job_title,employer_name,employer_website,job_publisher,job_apply_link,job_description,job_is_remote,job_posted_at,job_location,job_google_link,job_salary,job_min_salary,job_max_salary,job_salary_period
Director of Engineering,TTT Studios,http://ttt.studio/,Indeed,https://ca.indeed.com/viewjob?jk=477ea3c41e04ea41&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"Company Profile

TTT Studios is a digital consulting and software developing company working for a global client list in multiple industries. Over the past decade, we’ve built multiple applications and patented a portfolio of technologies. This experience has put us in the best position to cater to larger accounts and launch our own products. Our culture is essential to our company, and we foster an open and welcoming environment for everyone on our team. We understand that success comes from sweating the details. Carefully considered design—whether in our user interface work, technical architectures, or project management processes—is at the core of everything we do. We expect amazing things from each other, and through tight collaboration, we achieve greatness.

Candidates must be currently based in the Vancouver Area.

About the Role - Director of Engineering

We are seeking an experienced and visionary Director of Engineering to lead our talented development team and drive excellence in project delivery, team growth, and client satisfaction. This role is perfect for someone who thrives at the intersection of technology, business strategy, and team leadership.

Responsibilities

Level up the Engineering team
• Encourage creative strategic thinking, and business acumen
• Coach team members especially Project Tech Leads on how to connect technical decisions to user's needs, client satisfaction, and project budget
• Establish coding standard and code review best practices and ensure team members’s adherence

Cross-functional collaboration
• Ensure smooth communications and alignment with Project Management and Design across the project lifecycle
• Work with Sales to create proposal that fits client’s business requirements and constraints. Review contracts and aid Sales to close deals.

Efficient delivery and operation
• Meet project milestones and client expectations by working with Project Tech Leads closely
• Streamline workflows and automate process
• Improve delivery time and estimation discrepancy
• Assign the right team members to projects, optimize resource allocation to maximize productivity and minimize bottlenecks

Demonstrate our core values in your day-to-day
• Adapt to the unpredictable
• Best ideas win
• Extreme ownership
• Relentless pursuit of quality
• Lead by example

Requirements

Experience & Leadership
• Proven experience (8+ years) in software engineering with at least 3+ years in a leadership role (e.g., Engineering Manager, Technical Director).
• Demonstrated success in managing and growing technical teams, mentoring team leads, and fostering a collaborative environment.
• Strong understanding of how to align technical solutions with business objectives and client satisfaction.

Technical Expertise
• Deep understanding of software development lifecycle (SDLC), modern development practices, and coding standards.
• Proficient in multiple programming languages and frameworks, with the ability to provide technical guidance.
• Familiarity with DevOps practices, automation, and optimizing workflows.

Project and Resource Management
• Strong track record of managing multiple projects simultaneously, meeting milestones, and exceeding client expectations.
• Experience with resource allocation and team optimization to ensure maximum productivity.
• Ability to improve delivery timelines and reduce estimation discrepancies.

Cross-Functional Collaboration
• Experience working closely with design, project management, and sales teams to ensure alignment throughout the project lifecycle.
• Ability to create client proposals, review contracts, and support sales in closing deals.

Strategic Thinking & Problem-Solving
• Demonstrated ability to think strategically, balancing technical and business needs.
• Creative problem-solving skills with a focus on continuous improvement and innovation.

Soft Skills & Values Alignment
• Excellent communication skills with the ability to inspire, motivate, and clearly articulate complex ideas to diverse stakeholders.
• Alignment with core values: Adaptability, embracing the best ideas, extreme ownership, relentless pursuit of quality, and leading by example.

Education & Certifications (optional)
• Bachelor’s or Master’s degree in Computer Science, Engineering, or related field.
• Certifications in project management (e.g., PMP, Agile) or specific technical domains are a plus.

Business Acumen
• Understanding of how technical decisions impact project profitability and client satisfaction.
• Ability to balance client constraints with delivery excellence.

Hiring Process
• Submit your application and include your CV
• If shortlisted, you will be invited to a video interview with our HR Manager
• Next, we will arrange an online technical interview to assess your experience, technical skills, and fit for the role, as well as your alignment with our company culture and values
• After completing all rounds of interviews, we will make a final decision

Beyond the Paycheque

Never stop learning

Our commitment to growth also extends to your professional development. Take advantage of our education fund to attend conferences, workshops, and classes or pursue industry certifications. We also offer access to online learning resources to help you continue your education.

Invest in your well-being

We want you to be the best version of yourself. Our comprehensive benefits package includes generous paid time off, coverage for health, vision, dental, prescriptions, and subsidized health programs and perks. Our complete benefits package will take care of you and the well-being of your loved ones.

Surprise yourself with yoga & boxing lessons

Join our weekly expert-led yoga and boxing classes to enhance your physical and mental wellness. Learn how to throw a left uppercut or the latest asanas.

Enjoy profit-sharing bonuses

With each team member contributing to the overall success of TTT Studios, we reward everyone with performance and profit-sharing bonuses.",False,12 days ago,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DDQ0Z5Zx07_jTCtsDAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,
Director of Engineering,SKEENA GOLD + SILVER,http://www.skeenaresources.com/,Indeed,https://ca.indeed.com/viewjob?jk=949914bbd983cb06&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"Skeena Gold and Silver is a Canadian mining company with a portfolio of exploration and development projects located in northwest British Columbia, Canada. Our current focus is on the revitalization of the high-grade, past-producing Eskay Creek gold-silver mine. Skeena is committed to leading the industry in reconciliation, diversity, and inclusion and we work in close collaboration with our Indigenous partners, leveraging their traditional knowledge and respect for the land.

As a Skeena employee, you will become part of a dynamic, innovative, and results-driven work environment. Together, alongside colleagues of diverse backgrounds and experience you will help us operate safely, protect the environment, positively contribute to our local communities and build a state of the art mine in Canada. Come join our team to be a part of this amazing opportunity!

Job Title: Director of Engineering

Reporting to the VP, Construction and Engineering, the Director of Engineering is accountable for the detailed engineering and construction interfaces with the Skeena Gold and Silver's Eskay Creek infrastructure. This is a leading role to manage a cross-functional team of Skeena employees and Consultants, to deliver the Eskay Creek project engineering within time and budget expectations. This role will report to the VP, Construction & Engineering and will include significant interaction with Skeena’s Environmental & Regulatory Affairs team. Essential skills include EPCM/EPC project execution, holding teams accountable, strategic thinking, leadership, effective communication, interpersonal skills, integrity and transparency, cost control, planning/scheduling, key quantity tracking, estimating & document control, scheduling, reporting, estimating and budgeting for the Eskay Creek Revitalization project to ensure a cost effective and efficient delivery.

Position Responsibilities (including but not limited to):
• Manage the engineering design for various areas of the Eskay Creek Project, specifically the process infrastructure, non-process infrastructure and associated facilities, tailings facility, and power supply/distribution
• Responsible for effective project controls, consultant accountability, budget and schedule aligned to the recently completed Feasibility study business case.
• Align and demonstrate Skeena values of safety and sustainability.
• Lead an on-site team of engineers, supervisors and technical support personnel in completing assigned scope within committed timelines and budget.
• Ensure that all aspects of the Project implementation adhere to Skeena policies, procedures, Health & Safety, Environment and Community standards.
• Manage the overall relationships with multiple contractors, specialist contractors, consultants, and various stakeholders.
• Provide regular updates to the leadership as well as work closely alongside senior management.
• Participate in the preparation, evaluation, recommendation, and award of contracts, including preparation of scopes of work, requests for proposals, schedules, cost estimates and qualified bidder lists.
• Identifies critical path issues and ensures plans are in place to meet key schedules and deliverables.
• All other related duties.

The Ideal Candidate

Education / Qualifications:
• Bachelor’s or Master’s degree in a relevant Engineering discipline, or a related field.
• Professional Engineer (P.Eng.) designation in British Columbia or eligibility for registration with Engineers and Geoscientists BC (EGBC)

Experience / Skills:
• Minimum of 10-15 years of progressive experience in the mining industry, with at least 5-7 years in a senior engineering leadership role, ideally in a New Build Construction environment
• Strong computer skills using MS office suite is required.
• Excellent written and verbal communication skills.
• Has demonstrated strong leadership skills
• Must possess very strong attention to detail.
• Excellent problem-solving, communication, and project management skills.
• Ability to work collaboratively in a team and independently as needed

Work Location & Conditions

This role will be split between time spent at the Vancouver Corporate office and the Eskay Creek site in Northwest BC. A significant amount of time each month will be spent at site, and it is a requirement of this role.

This job requires the incumbent to be able to work away from home and to be able to travel to different work locations or events outside of regular office hours as well as traveling to Skeena’s remote project sites to collaborate with internal and external parties.

All Applicants MUST be legally entitled to work in Canada. Priority hiring consideration will be given to Indigenous Nations members who reside within the territories our projects are located.

We thank all candidates for their interest, however, only those considered for an interview will be contacted.

Compensation

The expected salary range for this position is CA$200,000 - CA$240,000, in line with the competitive job market for such roles carried out in British Columbia. Salary ranges are guidelines and any job offer received by a candidate will be determined on a number of factors such as relevant education, training, and/or experience.",False,,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Dq2t65ENLaC1uYABZAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,YEAR
Engineering Support and Infrastructure Manager (Remote),Whitecollars,https://www.whitecollars.net,LinkedIn,https://ca.linkedin.com/jobs/view/engineering-support-and-infrastructure-manager-remote-at-whitecollars-4181875334?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"Whitecollars offers diverse career opportunities, connecting you with jobs near you, remote positions, or roles that allow you to travel. Whether you're looking for flexibility or adventure, we help you find the perfect job that fits your lifestyle and career goals. Your next opportunity starts here!

Our Client

Our client is a cutting-edge SaaS platform that empowers fleet operators to plan, optimize, and manage zero-emission fleets. Their customers include transit, school bus, logistics, and local government transport providers transitioning to an EV future. With approximately 200 customers in ten countries, including one of the ten largest transit systems in the U.S., they are a revenue-generating, fast-growing technology company dedicated to customer value creation and scalability.

Following the successful first close of a US$10 million funding round, they continue to expand and innovate within the EV charging space.

About The Role

We are seeking a highly experienced Engineering Support and Infrastructure Manager to enhance our software engineering capabilities by managing infrastructure, security, compliance, and operational needs. This role will ensure our engineering and product teams can focus on core development while maintaining a secure and efficient infrastructure.

As a key member of our team, you will integrate cross-functional responsibilities across Product, Software Engineering, Customer Success, and IT. This position reports to the Head of Engineering and will evolve into a leadership role, coaching engineering teams and leading an internal or outsourced team.

Key Responsibilities
• Lead infrastructure initiatives across the company, including AWS management, GitLab administration, and information management systems.
• Manage corporate IT operations, such as Google account administration, onboarding/training, software licensing, and purchasing.
• Own and manage security initiatives, ensuring SOC2 compliance, security controls, and penetration testing.
• Guide engineering teams in adopting DevOps practices, improving CI/CD pipelines and SCM activities.
• Act as the primary contact for US time zone Support Engineering activities, working closely with Customer Success and Product Development to resolve infrastructure-related issues.
• Coach the engineering team on best practices in infrastructure, security, and operational tooling.

Core Competencies & Skills

Infrastructure Management (Critical)
• Extensive experience managing infrastructure and IT needs across diverse environments, ensuring scalability and performance.
• Ability to develop and maintain policies for secure, scalable infrastructure.

DevSecOps Practices (Critical)
• Integrate security practices into infrastructure and operations.
• Oversee penetration testing and compliance enforcement.
• Ensure a secure infrastructure through multi-layered testing and CI/CD tools.

Support Engineering (Critical)
• Bridge Customer Success and Product Development to resolve complex infrastructure-level issues.
• Read and understand existing code and algorithms to support incident resolution.
• Maintain a strong user focus to ensure an optimal customer experience.

Problem-Solving & Innovation (Critical)
• Analyze complex technical problems, identify root causes, and propose innovative solutions.
• Strong analytical and critical thinking to break down intricate issues into manageable parts.

Software Development & Agile Practices (Core)
• Guide teams in DevOps practices, CI/CD, and SCM activities.
• Contribute to product vision, strategy, and roadmap.
• Proficient in agile methodologies and collaborative autonomy to deliver value consistently.

Leadership & Growth Potential (Core)
• Proven ability to mentor and scale teams supporting infrastructure, tooling, and operational excellence.
• Experience leading specialized teams to support strategic decisions.

User & Commercial Focus (Beneficial)
• Strong understanding of user needs to ensure that engineering efforts align with business goals.
• Communicate technical insights effectively to non-technical stakeholders.

Personal Behavioral Competencies
• Initiative & Drive: Self-starter who takes ownership and sees tasks through to completion.
• Objectivity & Adaptability: Ability to assess problems based on actual conditions and adjust to changing situations.
• Critical Thinking: Evaluate situations from multiple perspectives to determine the best solution.
• Empathy & Humility: Values diverse perspectives, listens to feedback, and adapts behaviors accordingly.
• Curiosity & Learning: A strong desire to continuously improve and expand knowledge.
• Communication: Excellent ability to convey complex ideas clearly and work effectively across diverse teams.

Ideal Candidate

The ideal candidate is an experienced engineering leader with deep expertise in infrastructure, DevOps, and IT operations within a high-tech setting. They excel in cross-functional collaboration, take pride in maintaining secure and efficient systems, and are passionate about empowering engineering teams. This role is best suited for someone who enjoys a balance between technical hands-on work and strategic leadership.

Preferred Location: US West Coast.

Why Join Us?
• Impactful Work: Lead key infrastructure and security initiatives in a high-growth, tech-driven environment.
• Career Growth: Opportunities to build and lead specialized teams while contributing to strategic decisions.
• Collaborative Culture: Work alongside skilled professionals in a supportive, cross-functional environment.
• Remote Flexibility: Enjoy the benefits of a remote-first work environment while maintaining strong team connections.

Interested? Apply today and help us drive innovation in engineering support and infrastructure!",False,2 days ago,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DMIhyBzf9i_rwrn-DAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,
Head of Engineering Department,Portable Electric Ltd.,http://portable-electric.com/,Trabajo.org,https://ca.trabajo.org/job-3051-cb323c50885b0137540d8e38ae43dfaf?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"Drive Innovation and Sustainability

We are seeking an experienced leader to join our team as the Director of Engineering. As a key contributor to our success, you will be responsible for driving innovation and sustainability through the development and implementation of new technologies.

At Portable Electric Ltd., we believe in fostering a culture of innovation, inclusivity, and continuous improvement. If you share our values and are passionate about making a real impact, we invite you to join our team and help shape the future of clean technology.

About the Team:
• Collaborative and dynamic team environment.
• Ongoing training and professional development opportunities.
• Purpose-driven work with a clear focus on sustainability and innovation.",False,13 hours ago,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DtTBPUlSwxwtmfYQ8AAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,
"Director, Software Engineering",Great Canadian Railtour Company Ltd,,Indeed,https://ca.indeed.com/viewjob?jk=a2fa53e1422c869a&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"Purpose

The Director, Software Engineering reports into the Vice President, Information Technology & Digital Transformation.

We are looking for a passionate and innovative Director of Software Engineering to champion and evolve our core software systems and applications. The role will build, develop, and lead talented teams of software and quality assurance developers, analysts and administrators. The incumbent will be a visionary leader, a technical partner, a product advocate, an agile delivery enthusiast, a people enabler and an achiever.

Key Areas of Accountability
• Defining and implementing technical strategies and roadmaps in alignment with the company's objectives.
• Leading and managing multiple software engineering teams, fostering a culture of innovation, collaboration, and continuous improvement.
• Overseeing the design, development, and delivery of high-quality software products and services.
• Collaborating with product management, design teams, and other stakeholders to ensure successful product releases.
• Ensuring adherence to best practices in coding, testing, and deployment, and maintaining high standards of software quality.
• Driving the resolution of technical challenges and leading efforts to improve engineering processes.
• Establishing metrics and monitoring systems to track performance, productivity, and customer satisfaction.
• Ensuring compliance with regulatory standards and addressing security concerns throughout the software development lifecycle.
• Managing the software engineering department's budget, resource allocation, and project prioritization.
• Mentoring and developing team members, including hiring, training, and performance evaluation.
• Staying abreast of emerging technologies and industry trends to incorporate into the organization's practices.
• Facilitating communication and collaboration within the engineering team and across departments to achieve strategic IT and overall business goals.

Qualifications

Education/Certifications/Knowledge
• Undergraduate degree in Computer Science or Engineering
• Expertise in Salesforce, Drupal, Java / REACT, and or .NET

Experience
• 10 years’ experience in software, including 7+ years in a leadership role. Possess strong computer science credentials as well as a track record of building quality services.
• Proficient with some of the following Languages, Frameworks & Technologies: Java, Spring, JavaScript, Hibernate, Tomcat, REST, HTTP, JSON, JUnit, TestNG, Jenkins, Maven, Git and Docker
• Equally passionate about technology and solving large scale complex business problems.
• A continuous learner who is pro-active in their drive to improve their technical skill and knowledge.
• An established self-starter who possesses a relentless drive to initiate change, raise the technical bar.
• Expert knowledge of professional software engineering practices and best practices for the full software development life cycle.
• Clear, professional communication skills with ability to contribute to team discussions, knowing when to contribute, when to listen, and when to ask questions.
• Excellent interpersonal skills and enjoy working in a highly iterative, agile and collaborative team environment.

Work Environment
• Hybrid role with 3 days from office based in Vancouver.

Compensation
• The base salary offered for this role is $150,000 to $180,000 per annum and can vary based on job-related expertise, qualifications, experience and internal equity.
• Eligible for Rocky Mountaineer’s discretionary bonus program

Eligible Benefits

Rocky Mountaineer supports our team members’ health and wellness by providing a comprehensive medical plan with 100% employer paid premiums, some of which includes:
• Medical, Dental, Vision, Life Insurance
• Short term disability, long term disability benefits
• Travel emergency assistance
• Vacation time and sick time
• Up to 5% RRSP and/or TSFA match
• Two complimentary annual train tickets after first year of employment

Rocky Mountaineer is an equal opportunity employer, driven by our values of creating meaningful moments, being one team, and achieving extraordinary outcomes. Our strong company culture supports our vision of a diverse, open, safe, and respectful workplace. We celebrate diversity and are committed to creating an inclusive environment for all team members. If you require any accommodation during the application process or throughout your employment, please let us know. We will work with you to ensure your needs are met and to create a supportive environment.

Please ensure to opt-in for text messages when you apply in order to receive interview updates.",False,18 days ago,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Dhqva-8B5EyPMuGE5AAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,YEAR
"VP, Data Engineering",Confidential Jobs,,LinkedIn,https://ca.linkedin.com/jobs/view/vp-data-engineering-at-confidential-jobs-4176972428?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"📍 Remote | Full Time | Vancouver, Canada

A leading technology company is seeking a VP, Data Engineering to lead and scale its data engineering function. This is a confidential search for a high-impact leadership role requiring technical expertise, strategic thinking, and people management.

The VP, Data Engineering will be responsible for developing and optimizing the organization's data infrastructure, designing scalable pipelines, and ensuring alignment with business objectives. This role requires a leader with a strong background in big data architectures, cloud platforms, AI/ML, and modern data engineering best practices.

What You’ll Do:

Strategic Data Architecture & Scalability
• Design and oversee scalable, robust data architectures that support current and future data needs.
• Ensure modern data platforms, data lakes, and cloud technologies (e.g., Snowflake, AWS) can efficiently handle increasing data volumes.
• Implement best practices for data pipeline observability (O11y) to ensure resilience, scalability, and real-time monitoring.
• Establish automated dashboards (e.g., Grafana, Airflow, CloudWatch) to provide full visibility into data pipelines and enable prompt response to outages or inconsistencies.

Data Governance, Compliance & Security
• Develop and implement data integrity, quality, and security processes/workflows to ensure compliance with regulatory requirements.
• Ensure data security policies are aligned with industry best practices, reducing risks related to data breaches or mismanagement.

Cross-Functional Leadership & Collaboration
• Partner with software engineering, product, analytics, and business teams to align data strategies with organizational goals.
• Bridge the gap between technical and non-technical teams, effectively communicating complex data concepts to stakeholders.
• Drive data-driven decision-making by enabling business teams with actionable insights and reliable data.

Advanced Analytics, AI/ML & Data-Driven Innovation
• Leverage data for advanced analytics, AI, and machine learning applications to drive business value and competitive advantage.
• Enable predictive insights, automation strategies, and AI-driven decision-making to enhance product offerings.

Required Skills & Experience

Must-Haves:

✅ 10+ years of experience in data engineering, with at least 5 years in a leadership role.

✅ Expertise in big data ecosystems, including data lakes, lake houses, and modern cloud architectures.

✅ Proficiency in SQL and Python for data manipulation and engineering workflows.

✅ Hands-on experience with Kubernetes and containerized data workflows using tools like DBT and Airflow (or similar).

✅ Experience with streaming data solutions using Kafka, Pulsar, or similar technologies.

✅ Strong expertise in data warehousing tools such as Snowflake, BigQuery, or Redshift.

✅ Deep understanding of data modeling, performance optimization, and indexing strategies.

✅ Experience scaling SQL systems (vertical and horizontal) on-premises and in the cloud.

✅ Proven track record managing cloud-based data solutions (AWS, GCP, or Azure), including storage, compute, and security best practices.

✅ Expertise in PostgreSQL, PostGIS, Citus, Amazon Aurora, and Azure CosmosDB.

✅ Strong knowledge of data governance, security, and regulatory compliance.

Nice-to-Haves:

⭐ Experience implementing SQL and NoSQL stores with large-scale data volumes.

⭐ Strong knowledge of distributed computing frameworks such as Apache Spark, Dask, or Presto.

⭐ Familiarity with data paradigms such as Lambda and Kappa architecture.

⭐ Hands-on experience conducting cost-benefit analysis for enterprise-level data stores.

Education

🎓 Bachelor's degree in Computer Science, Engineering, Mathematics, or equivalent experience.

Why Join?

This is a confidential opportunity with a high-growth company offering:

✅ Competitive salary 💰

✅ Amazing benefits! More information to be provided during the interview.

✅ Remote work environment—always! 🏡

✅ A visionary leadership team guiding industry innovation 🚀

Equal Opportunity Employer

This organization is committed to fostering a workplace that celebrates diversity, inclusion, and belonging. We are proud to be an Equal Opportunity Employer and encourage applications from candidates of all backgrounds.

💡 Ready to lead the future of data engineering? Apply today! 🚀",False,9 days ago,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DZuZDiBH5v5uXQWGwAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,
Director of Engineering,Sheraton Vancouver Airport Hotel,,Indeed,https://ca.indeed.com/viewjob?jk=ab61a14e8fc391be&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"The Sheraton Vancouver Airport Hotel offers guests the best of many worlds: the luxury of an upscale Hotel experience just minutes to the Vancouver International Airport, the convenience of being located in the heart of Richmond, British Columbia's many business districts, and the pleasure of residing steps from plentiful shopping and unforgettable cultural experiences. Guests can simply relax and enjoy a restful sleep in one of our 390 spacious guest rooms or connect with family and friends in Starbuck's, or Harold's Kitchen & Bar. For our guests planning a conference, the Sheraton Vancouver Airport offers 32,000 square feet of meeting and convention space. At the Sheraton Vancouver Airport, we are about building new and exciting relationships and our values reinforce our commitment to cultivate meaningful connections with our guests and one another.

Position Overview:

Reporting to the General Manager, the Director of Engineering is a hands-on Department Head position that is responsible for managing the Property Maintenance (Engineering) operations and ensuring standards established by the Hotel and the Brand is met.

The successful candidate’s profile:

The Director of Engineering demonstrates our company and Sheraton values and models the desired service behaviors in all interactions with guests and associates. This individual has an “open door policy” and establishes an open, collaborative relationship with all associates and business partners. They are clear on the hotel’s strategic priorities by setting goals and expectations with their team and provide guidance and coaching through constructive performance feedback. The Director of Engineering ensures alignment between all operational departments in support of the hotel’s strategic priorities, while exercising proactive judgment.

The Director of Engineering will be responsible for:

Operational Responsibilities

· Lead and direct the Engineering team to ensure the smooth operation of property maintenance functions

· Provide a hands on approach in training the Engineering team as required

· To oversee all major and minor mechanical systems throughout the hotel, ensuring that systems are fully operational

· Manage everyday requests from operating departments within the Hotel including guest related requests

· Ensure the property is maintained to the highest standards and in a safe manner

· Develop, recommend and implement the department’s budget and capital expenditures and manage expenses within approved budget constraints;

· Responsible for inventories of operational supplies and equipment; Monitor and manage equipment inventory audits to ensure optimum work resources

· Coordinate renovation bidding and repairs/projects. Define the cost and scope of the project and oversee the general contractor and subcontractors to ensure quality work is performed for minimal cost

· Develop and hold accountable preventative maintenance practices which ensure the longevity of all equipment, including the monitoring and tendering of all service contracts

· Develop, implement and manage energy conservation initiatives to mechanical and electrical system to minimize costs

· Hold regular department meetings; responsible for establishing department objectives, policies and procedures, designed to provide service levels, which exceed the expectations of both internal departments and guests

· Participate in recruitment, selection, training and performance management of all Engineering associates; acts as a resource to associates

· Monitor work hours, scheduling and vacation planning of Engineering associates based on hotel occupancy and work volumes

· Oversee all Fire & Life Safety Systems and is responsible for the training of all employees on these initiatives

· Hold regular fire drills and is an active participant in the Health & Safety Committee

· Maintain a safe working environment for all employees, occupants and visitors to the property

· Performs other duties within Engineering, as assigned or required by the General Manager

The successful candidate will have the following:

· Candidate must have a minimum of 3-4 years of progressive management experience with strong knowledge and understanding of the Engineering and Maintenance process in commercial buildings. Knowledge of accommodation buildings preferred

· Engineering degree/diploma preferred and 4th Class Power Engineering certification would be considered an asset

· Experience in preventative maintenance, energy management, fire safety, and health and safety

· Demonstrated leadership experience and organizational skills with an excellent eye for detail is a must

· Must be available in person or by phone 24/h day, 7 days a week, for key and critical first response for all emergency situations including but not limited to fire, flood, electrical or mechanical failures within the Hotel.

· Previous management experience involving maintenance of Budget, Forecasting, Inventory & Cost Control, as well as budget preparation is an asset

· Proven ability to handle high stress and work under frequent peak period conditions

· Demonstrated ability with regard to computer skills, including Microsoft Office

Larco Hospitality is committed to employment equity regardless of national or ethnic origin, color, religion, gender, sexual orientation, age or disability. Larco Hospitality welcomes and encourages applications from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the selection process.

Job Type: Full-time

Pay: $95,000.00-$100,000.00 per year

Work Location: In person",False,9 days ago,"Richmond, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DEQ2BL45NYnb-g_cKAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,YEAR
"Department Manager, Mechanical Engineering (Minerals & Metals) - Vancouver",Ausenco Careers,http://www.ausenco.com/,Career Opportunities At Ausenco,https://careers.ausenco.com/jobs/department-manager-mechanical-engineering-minerals-metals-vancouver-vancouver-british-columbia-canada?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"Ausenco is a fast-growing company with big ideas. We redefine what’s possible in some of the world’s most complex projects and toughest environments. Delivering innovative, value-add consulting, project delivery, asset operations and maintenance solutions is what we do. From 26 offices in 15 countries, with projects in over 80 locations worldwide, we create sustainable outcomes for our people, clients and communities.

We are currently recruiting for a Department Manager, Mechanical Engineering to join our Minerals & Metals team in Vancouver.

The Department Manager, Mechanical, will lead the Mechanical Engineering team in driving mining projects and studies across BC and globally. This role involves setting the strategic direction and overseeing the discipline and offers the opportunity to shape and drive the success of the department.

About the role
• Lead and manage the mechanical engineering team, ensuring projects are completed on time and to the highest standards by overseeing performance, reviewing deliverables, and providing expert technical guidance.
• Drive cost-efficiency by managing project budgets, reviewing and approving mechanical capital cost estimates, and exploring innovative approaches to improve outcomes.
• Ensure the mechanical team has access to up-to-date technical standards, reference materials, software, and tools to excel in their work.
• Collaborate with project teams to review and approve discipline-specific strategies and engineering plans alongside the Mechanical lead.
• Coordinate and arrange technical reviews as required by operating procedures and project execution plans.
• Build strong relationships with clients, identifying their needs and offering tailored solutions to meet project goals.
• Partner with leadership teams across offices to optimize resource sharing and inter-office collaboration.
• Work with People & Performance to recruit, select, and onboard top talent, while effectively managing team workload.
• Mentor and support team members in their personal and professional growth, providing both technical expertise and career development guidance.
• Conduct performance reviews, offering leadership and support to enhance team performance and deliver technical excellence.
• Foster a collaborative, customer-focused environment that promotes trust, innovation, teamwork, and high-quality results for client satisfaction.

About you
• Bachelor’s degree in mechanical engineering.
• 15+ years’ proven technical and management experience with an engineering consulting firm or other large organization; construction experience is desirable.
• Previous experience in the Minerals & Metals industry
• Previous experience leading and guiding engineering teams.
• Registration as a Professional Engineer (P.Eng).
• A proven track record managing multiple projects simultaneously or a single project of major size and scope.
• A proven ability to deliver projects on time and on budget.
• An excellent understanding of Mechanical engineering specifications, industry standards, practices, applicable codes including national, provincial and local codes, acts and regulations.
• Strong problem solving and organization skills and ability to meet tight deadlines while providing exceptional service to our clients is a must.
• Understanding of project budgets.
• Excellent verbal and written communication skills
• Willingness to travel.

Why Ausenco?

We support individual growth and aim to allow you to work in a way that plays to your strengths. Beyond a competitive remuneration package, we offer:

Career advancement - Embark on a journey of continuous growth through technical training, mentorship initiatives, and networking opportunities.

Work Life Balance – Experience the best of both worlds with our hybrid work model, allowing you to balance office days with working from home; and progressive parental leave benefits to foster family needs and professional life.

Accessible leadership team – Work with highly reputable industry leaders who value your contribution.

Our people don’t settle for the status quo. If you have an entrepreneurial spirit and want to help set a new standard in sustainability, we’ll help you find your place. This means working with you to develop a unique career path and skillset to match your ambition.

We’re proud of the work we do, and we do it within a culture that is open, honest, and cooperative. We have a history of attracting visionary people who embrace challenges and deliver creative solutions for every project, and your voice is an important part of the conversation.

As a global company we embrace and encourage diversity in its fullest sense – gender identity, gender expression, sexual orientation, age, experience, nationality, colour, language, religion, location, disability, education, skills, working styles and time availability. Our work environments are based on mutual trust and respect for the rights and opportunities of every individual.

Salary range: $150,000 - $190,000 annually

Expected Salary: Variation in salary is determined by factors such as qualifications, relevant years of experience, and prevailing market conditions for the specific role.

Join us and work a better way.",False,,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DsylJc7pm7kIi46PXAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,
Rail Systems Requirements Engineering Lead,Mott MacDonald,http://www.mottmac.com/,LinkedIn,https://ca.linkedin.com/jobs/view/rail-systems-requirements-engineering-lead-at-mott-macdonald-4184088228?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"Here at Mott MacDonald, we are experts in engineering, management, and development services supporting multisector project work in over 150 countries. One of the largest employee-owned companies in the world, we pride ourselves in our ability to deliver exceptional outcomes through the connected thinking of our 20,000+ talented consultants. Sustainability and innovation are at the heart of all of our sectors which, in North America include Advisory, Built Environment, Energy, Transportation, and Water.

Mott MacDonald's Toronto office is looking to hire a motivated individual, reporting to the Rail Systems Lead, to develop, support and lead the execution of the requirements engineering and requirements management activities on projects executed by Mott MacDonald in North America.

Responsibilities will include, but are not limited to, the following:
• To ensure Mott MacDonald is aligned with emerging trends in requirements engineering processes and tools
• To develop and maintain relationships with members of the Rail Systems Practice and the greater Rail & Transit Practice in North America and elsewhere
• Contribute to the development, adoption, and delivery of Requirements Engineering (RE) and Requirements Management (RM) processes and practices within MM’s North American practices
• Lead the Requirements Engineering (RE) and Requirements Management (RM) elements of project bids and project delivery within Mott MacDonald Canada, including interfacing with Design, Project and Systems Engineering teams together with budget development as necessary
• Develop and maintain Requirements Engineering (RE) and Requirements Management (RM) processes that ensures quality of delivery and currency of Requirements Engineering (RE) practices within Mott MacDonald
• Provide direct Requirements Management (RM) support and insight to each project’s management and delivery team
• Develop and work with key delivery partners and service providers for projects
• Engage with end clients as and when necessary
• Write, update, and maintain Requirements Management Plans for new and existing projects
• Apply lessons learned and advise on necessary corrective actions for ongoing projects
• Delivery of high quality, verifiable requirements to support all stages of a Project life cycle

Candidate Specification
• Bachelor's Degree in Engineering/Science (preferably IT/ Systems Engineering)
• Minimum 10 years’ progressive experience in Requirements Engineeringwith significant experience in rail and transit projects
• Demonstrable strength in a minimum of one of the following:
• Integration and Interface Management
• IEC 15288: 2015
• Requirements Management
• Experience with DOORS NG is an asset
• INCOSE ASEP or CSEP certification is desirable
• Good communication skills and English fluency
• Good interpersonal skills with proven ability to work effectively as part of a multi- disciplined team
• Able to hold competent technical discussions with Client representatives
• Able to interface with domain specialists, design managers and construction project managers, in a competent professional manner

Our teams are comprised of bright and enthusiastic people who wish to make a difference to the world that we live in. If you share that vision and don’t have all the experience outlined in this posting, we still want to hear from you!

Let’s discuss how we can help you take the next step in your career and how you can participate in an exciting new chapter for Mott MacDonald in North America.

We are an equal opportunity employer and are committed to providing employment accommodation in accordance with the Ontario Human Rights Code and the Accessibility for Ontarians with Disabilities Act, 2005 (AODA). Mott MacDonald Canada Limited will provide accommodations to job applicants with disabilities throughout the recruitment process. If you require an accommodation, please notify us and we will work with you to meet your needs.

We seek to promote fair employment procedures and practices to ensure equal opportunities for all. We encourage individual expression in our workplace and are committed to creating an inclusive environment where everyone feels they have the opportunity to contribute.

Hybrid working policy

At Mott MacDonald, we believe it makes business sense for you and your manager to choose how you can work most effectively to meet your client, team, and personal commitments. We offer a hybrid working policy that embraces your well-being, flexibility, and trust.

More About Mott MacDonald

We’re a global engineering, management and development consultancy.

Our purpose is to improve society by considering social outcomes in everything we do, relentlessly focusing on excellence and digital innovation, transforming our clients’ businesses, our communities and employee opportunities.

A fundamental part of this is respecting each person’s differences and striving to meet their needs.

Our values: progress, respect, integrity, drive, excellence

Location(s):

Toronto, ON, CA Calgary, AB, CA Vancouver, British Columbia, CA

Contract Type: Permanent

Work Pattern: Full Time

Market: Transport

Discipline: Systems and signals

Job Ref: 7346

Recruiter Contact: Katie Champoux",False,2 days ago,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3D_MF-PwEQVbYsjLegAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,
Maintenance and Engineering Manager,Randstad Canada,http://www.randstad.ca/,Randstad,https://www.randstad.ca/jobs/maintenance-and-engineering-manager_vancouver_44712740/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"We are seeking a Maintenance and Engineering Manager for a well established manufacturing client of ours in the Vancouver area. This role will provide leadership to our clients maintenance department and will oversee both reactive and proactive maintenance support to the Plant. They will be responsible for department budgeting, plant capital expenditure, as well as professional and technical development of employees.

Advantages
- Competitive compensation and benefits package
- Opportunities for career advancement

Responsibilities
• Continuous Improvement: To be the champion of Reliability Centered maintenance activities, utilizing the Professional Maintenance World Class Manufacturing techniques in driving equipment reliabilities to the highest possible levels

• Systems Development: Oversight of the preventive/predictive maintenance systems/program development (including failure analysis and CMMS development) implemented, coached, monitored and continually improved. Ability to work within an SAP environment.

• Change Agent: Provides leadership, through guidance and oversight, to the cultural and technical growth of the department team members. Motivates, coaches and develops a diverse, high performing and engaged team to meet established goals and build organizational capability and mindset to function within a Reliability Centered organization.

Technical problem solving: Provides technical guidance and coaching on technical problem solving through the use of WCM tools to ensure root cause of issues are identified, eliminated and sustained to improve equipment reliability and capability.

• Maintenance: To manage the maintenance organization responsible for all plant physical assets including building, grounds, machinery and equipment.

• Engineering advancement: To manage plant engineering activities, covering design, cost estimation, request submissions, selection/construction, and compliance with local, provincial and federal, safety, environmental, health and fire prevention standards.

• Financial: Responsible for budget preparation, CAPEX planning and execution including department long range planning. Maintain store compliance and work flow practices.

• Customers and contacts: Collaborates with all plant and corporate functions in the coordination and scheduling of plant repairs, equipment modifications or installations; purchasing and accounting personnel on requisitions and capital request data; and corporate engineering on special projects.

Qualifications
• Bachelor’s Degree in engineering with P. Eng designation or equivalent combination of education and experience is required.
• 10+ years professional experience in progressive roles and knowledge of plant engineering/maintenance disciplines, such as automated control systems, programmable logic controllers, preferably in a continuous, 24/7 manufacturing environment.
• Highly technical, Multi-product manufacturing experience.
• Operations and Capital Budgeting, Planning and Reporting experience with a strong emphasis on accurate one-month and rolling forecasts.
• Strong knowledge of safety and environmental codes and regulations.
• Must demonstrate successful leadership and change agent skills in a unionized environment. Demonstrated ability to influence others without direct authority.
• Great interpersonal and communication skills.
• Excellent written and oral communication.
• Critical thinker and problem-solving skills.

Summary
If you would like to be considered for this opportunity please forward your resume via email to Nick Paraskeva nick.paraskeva@randstad.ca

Randstad Canada is committed to fostering a workforce reflective of all peoples of Canada. As a result, we are committed to developing and implementing strategies to increase the equity, diversity and inclusion within the workplace by examining our internal policies, practices, and systems throughout the entire lifecycle of our workforce, including its recruitment, retention and advancement for all employees. In addition to our deep commitment to respecting human rights, we are dedicated to positive actions to affect change to ensure everyone has full participation in the workforce free from any barriers, systemic or otherwise, especially equity-seeking groups who are usually underrepresented in Canada's workforce, including those who identify as women or non-binary/gender non-conforming; Indigenous or Aboriginal Peoples; persons with disabilities (visible or invisible) and; members of visible minorities, racialized groups and the LGBTQ2+ community.

Randstad Canada is committed to creating and maintaining an inclusive and accessible workplace for all its candidates and employees by supporting their accessibility and accommodation needs throughout the employment lifecycle. We ask that all job applications please identify any accommodation requirements by sending an email to accessibility@randstad.ca to ensure their ability to fully participate in the interview process.",False,,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Dr-dIVy9knYlV6o59AAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,
"VP, Engineering",Klue,https://klue.com,LinkedIn,https://ca.linkedin.com/jobs/view/vp-engineering-at-klue-4086406581?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"💡
• How do you attract, retain and inspire the best engineers to achieve?
• What are the best ways to organize to solve complex engineering problems and attain ambitious goals?
• How can the Engineering Org deliver the greatest impact for customers?
• How much planning is necessary before springing into execution?
• Are process and planning enablers of agility or do they form a tradeoff?
• What metrics should you track to validate progress?
• How do you achieve stable solutions and position for growth when the environment and expectations are subject to change?
• How would you enable free-wheeling innovation while achieving predictable delivery?

👆Do such questions occupy you?

❓Do you have opinionated views on some or all of them grounded in leadership experience?

Klue needs you.

Why are we looking?

We believe in hiring amazing people and giving them the space and resources to do their best work at Klue. We are well-funded, positioned for growth even in this uncertain environment, and are in search of an engineering leader to shape the next few years of our culture, ambitions, and execution mindset.

NOTE: We have kickstarted this application process but given end-of-year planning and end-of-quarter push, we will be beginning our interview process in early January.

What is key for us in the role?
• People are the key to our success. Naturally you will play a key role in attracting talent, and keeping engineering teams healthy and thriving. We want people to be motivated by what they work on and enabled to reach and even exceed their potential. You will be the primary owner of scaling the Engineering Team to conceive, deliver and maintain category leading software solutions.
• You will continuously audit programs and practices that build a vibrant engineering culture, develop employees, and ensure highly engaged teams to identify gaps and continue to elevate the Engineering Organization.
• You will work closely with our CTO & VP Product on our business vision, technology strategy, product roadmaps, and market positioning. You will work together with the rest of the Senior Leadership Team to establish appropriate priorities for Engineering teams that deliver the biggest impact to customers
• This isn’t an Engineering-only role - you’ll be expected to stretch outside of your comfort zone, and drive impact across the whole company. Put another way, as an SLT member, you’ll work closely with other leaders across the business as partners in order to drive company results.
• You will readily establish credibility with engineers, and lead in a manner that inspires trust and excellence.
• You will represent the needs of engineering teams and facilitate translating business goals into execution plans.
• You will be reporting directly to the CEO.
• Klue is a remote-friendly organization, we have employees in many time zones. Ideally you will be in Vancouver where the majority of the Engineering Team and Senior Management Team are located. A location in Toronto could work if you are willing to travel to Vancouver as necessary.
• Built out an organization, held people accountable, shipped innovative product.

What experience are we looking for to drive success?
• You have a passion for and experience leading development teams/organizations through inspiration and building on the vision for our product, company and category.
• You have plenty of related experience including leading the development process in partnership with product management.
• Experience recruiting, mentoring, and guiding a development team with empathy, transparency and inspiration to contribute to our culture and meet goals and objectives through your leadership style.
• You can build and lead engineer orgs with 30 to 300 people.
• You can partner with teams including Product, Sales and Customer Success to play a key role in executing on product roadmap.

What are the key responsibilities?
• Articulate the strategic vision of the company and the product to the engineering team to ensure transparency, alignment, inspiration and excitement to execute.
• Setting and executing on key performance measures for the engineering team to ensure company goals are met (if not exceeded!) including productivity and efficiency as we scale including key performance metrics
• Mentoring and evolving a career path for the management and development team
• Organizational design for both engineering teams and their PM/UX counterparts - working in conjunction with VP Product/CTO on team design as we scale
• Process design and implementation/change management
• Finance - Budgeting/forecasting as well as managing tax incentives like SR&ED / equivalent in other regions
• Communication of engineering goals, progress and status to broader stakeholders at Klue (CEO/Board/Org, etc.)
• Oversee the daily operations of our SaaS platform: 1) Budgeting / Cost controls / Ops strategy / Vendor management, 2) DevOps / Platform Engineering / SecOps, 3) Ensure SLA/SLOs are met including org-wide responses to issues

What’s our tech stack?
• Python, Ruby (Rails), React, TypeScript, Javascript, PostgreSQL, Elasticsearch, Redis, GCP, Tensorflow, Keras, Kubernetes, Docker

⬇️ ⬇️ ⬇️ ⬇️ ⬇️ ⬇️ ⬇️ ⬇️ ⬇️ ⬇️

Lastly, we take potential into consideration. An equivalent combination of education and experience may be accepted in lieu of the specifics listed above. If you know you have what it takes, even if that’s different from what we’ve described, be sure to explain why in your application. Reach out and let’s see if there is a home here for you now or in the future.

We’ve made a commitment to support and contribute to a diverse environment; on our teams and in our community. We’re early in our journey; we've started employee led resource groups, committed to Pay Up For Progress, and use success profiles for roles instead of 'years of experience'. We continue to scale our efforts as Klue grows. We’re proud to be an equal opportunity employer and have dedicated that commitment to our current and future #kluecrew. During the interview process, please let us know if there is anything we need to make more accessible or accommodate to support you to be successful.

All interviews will be conducted via video calls. We work in a hybrid model of WFH (remote) and in-office. We’re excited to meet you and in the meantime, get to know us:

🌈 Pay Up For Progress & 50 - 30 Challenge

✅✅ Win-Loss Acquisition (2023)

🐅 Series B (2021)

🏆 Culture, culture, culture!

🎧 Winning as Women & More!

🐝 About Us

🥅 Product Demo Arena

🔍 Glassdoor

🎥 Youtube

☕️ LinkedIn

🦄 Wellfound (AngelList)

Compensation Range: CA$250K - CA$300K",False,,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DpGHSjE0AwRtY6gzeAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,YEAR
Platform Engineering Director,Vancouver City Savings Credit Union,http://www.vancity.com/,BeBee,https://ca.bebee.com/job/75472df9c8c10874535451e583242f8c?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"Job Overview

We're seeking a Senior Platform Engineer to join our Digital Banking team. As a key member of this team, you will be responsible for managing and optimizing our technology platforms, ensuring operational efficiency, and providing end user support. You will collaborate with cross-functional teams to integrate systems, analyze complex data sets, implement effective solutions, and drive continuous improvements to enhance overall functionality and user experience.

This role supports the alignment of technology initiatives with business objectives and delivering outcomes. You will enjoy hybrid working arrangements which can be fulfilled primarily from the Vancity head office location and your Lower Mainland based home office or Ontario home based office.",False,2 days ago,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DY_rxWhXhIdI5wPTSAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,
engineering service manager,BC Hydro,http://www.bchydro.com/,Job Bank,https://www.jobbank.gc.ca/jobsearch/jobposting/43503330?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,Education: Bachelor's degree. Experience: 5 years or more. Green job: Involves duties and responsibilities that lead to positive environmental outcomes. Workplace information: Hybrid. Health benefits: Dental plan. Disability benefits. Health care plan. Vision care benefits.,False,17 days ago,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DHIBTGuIkYqicimLhAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,
Engineering Manager/ Sr Manager,Narvar,http://corp.narvar.com/,Indeed,https://ca.indeed.com/viewjob?jk=f72cdee07d26a8e6&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"Narvar is growing! Narvar's DNA (Data and Analytics) team is seeking an experienced Engineering Manager to lead our Online Infrastructure team. In this role, you will oversee the design, development, and optimization of scalable, high-performance real-time systems that power our customer-facing products. Your leadership will be pivotal in driving innovation, ensuring system reliability, and enhancing the customer experience. You will manage a team of talented engineers, fostering a culture of accountability and agility in a fast-paced environment.

Key Responsibilities:
• Lead the Online Infrastructure Team: Manage and mentor a high-performing engineering team responsible for real-time systems.
• Develop Scalable Systems: Oversee the development and implementation of scalable, high-performance online infrastructure.
• Collaborate Cross-functionally: Work closely with product, analytics, and other engineering teams to integrate real-time data insights into business strategies.
• Drive Innovation: Stay current with industry trends in real-time data engineering and cloud technologies to enhance our capabilities.
• Ensure System Reliability: Continuously improve the quality, performance, and reliability of online systems.
• Project Management: Utilize agile methodologies to ensure timely delivery of high-quality solutions aligned with organizational goals.
• Strategic Planning: Partner with senior leadership to shape the technical vision and roadmap for online infrastructure.

Required Qualifications:
• Bachelor's or Master's degree in Computer Science, Engineering, or related field.
• 10+ years of experience in online data engineering, real-time infrastructure, or technical leadership roles.
• Experience managing cross-functional teams, balancing both technical leadership and people management responsibilities.
• Proven expertise with distributed real-time processing systems (e.g., Google Pub/Sub, Dataflow, Apache Beam, Apache Kafka, Flink, Spark Streaming).
• Proficiency in programming languages such as Java, Python, Rust or Go.
• Strong foundation in real-time data processing and optimization of large-scale online systems like Cassandra, Bigtable etc.
• Experience with cloud platforms like GCP or AWS for building scalable online architectures.

Preferred Qualifications:
• Experience in high-growth environments or startups, focusing on scaling online systems.
• Familiarity with modern real-time data architectures at scale.
• Expertise in event-driven architectures and DevOps practices.
• Strong business acumen to align technical projects with overall business strategy.

Why Narvar?

We're on a mission to simplify the everyday lives of consumers. Post-purchase is a critical phase of the customer journey. That's why we created Narvar - a platform focused on driving customer loyalty through seamless post-purchase experiences that allow retailers to retain, engage, and delight customers. If you've ever bought something online, there's a good chance you've used our platform!

From the hottest new direct-to-consumer companies to retail's most renowned brands, Narvar works with GameStop, Neiman Marcus, Sonos, Nike, and 1500+ other brands. With hubs in San Francisco, London, and Bangalore, we've served over 125 million consumers worldwide across 10+ billion interactions, 38 countries, and 55 languages.

Pioneering the post-purchase movement means navigating into the unknown. Our team thrives on this sense of adventure while nurturing a mindset of innovation. We're a home for big hearts and we leave our egos at the door. We work hard but we always make time to celebrate professional wins, baby showers, birthday parties, and everything in between.

We are an equal-opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.

#LI-Remote

Please read our Privacy Policy to learn what personal information we collect in connection with your job application, and how we may use and share it.",False,,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Dgjf32qXEz1GmdSSeAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,
Engineering Manager,Verathon,http://verathon.com/,LinkedIn,https://ca.linkedin.com/jobs/view/engineering-manager-at-verathon-4182661094?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"Verathon is a global medical device company focused on supporting customers by being their trusted partner, delivering high-quality products that endure over time and ensure clinical and economic utility. Two areas where Verathon has significantly impacted patient care, and become the market leader in each, are bladder volume measurement and airway management. The company’s BladderScan portable ultrasound and GlideScope video laryngoscopy & bronchoscopy systems effectively address unmet needs for healthcare providers and meaningfully raise the standard of care for patients. Verathon, a subsidiary of Roper Technologies, is headquartered in Bothell, Washington, USA and has international subsidiaries in Canada, Europe and Asia Pacific. For more information, please visit www.verathon.com.

Verathon® is looking for an Manager, Sustaining Engineering to become the newest member of our R&D Team located in Burnaby, British Columbia. The Engineering Manager is responsible for leading a team of world class engineers and technicians to enhance and sustain our portfolio of medical products, applications, and accessories.

Principal Responsibilities:
• Lead a team of world class engineers and technicians to improve and sustain our latest medical products, applications, and accessories.
• Provide strong technical direction and functional leadership
• Develop a deep understanding of products and enabling technologies
• Engage in technical problem solving that affects product design, production, and availability
• Manage an engineering team from resource and budget planning to professional development, etc.
• Continuously improve team performance by setting objectives, priorities, and removing obstacles
• Enable the staff to operate efficiently and reach their full potential
• Accountable for setting expectations, including the output and quality of work produced by the team
• Contributes to the development of the product lifecycle roadmap
• Assess skillset needed by project, allocates resources, and manages active projects
• Advise management on best practices to improve design quality and development efficiency
• Stay current on emerging technologies to advance medical device designs using appropriate materials and methods
• Provide mentoring and coaching to team leads and staff

Qualifications
• Bachelor’s degree in Electrical or Mechanical Engineering is required; Master’s or MBA is preferred
• 6+ years of product development experience
• Typically requires a minimum of 2+ years’ people management experience
• Professional Engineer (P.Eng.) registration preferred
• Demonstrated technical knowledge and experience in key functional area
• Proven ability to solve cross-functional problems within project teams
• Capable of leading and developing a group of highly qualified engineering professionals
• Experience in developing product and processes using knowledge of customer needs, technology, and business acumen
• Strong interpersonal and communication skills, both verbal and written
• Experience in medical device or other highly regulated industry is preferred

Salary range - $94,000 - $137,000 (Compensation will vary based on skills, experience and location; it is not typical to be hired at or above the top of the salary range).

Full-time employees who are not on a commission plan are eligible for Verathon’s annual bonus plan based on company and individual performance.

Verathon provides a competitive benefits package including a generous HCSA, paid holidays, paid time off and a retirement matching plan.",False,1 day ago,"Burnaby, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DJXvMqnWv1XBYqDXFAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,
"Director, Cloud Engineering",Vancouver City Savings Credit Union,http://www.vancity.com/,Indeed,https://ca.indeed.com/viewjob?jk=74be0be9527cee17&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"About Vancity

Vancity is a member-owned credit union built on the principles of inclusion and social justice. A relentless commitment to their values has helped them challenge the status quo and break down barriers since day one in 1946. They have bold commitments to make Vancity net-zero by 2040 across all mortgages and loans and are pursuing strategies on Indigenous banking and to improve the financial resilience of their members.

Vancity is the largest private sector Living Wage Employer in Canada and has been consistently recognized as one of the Top Employers in Canada. If you’re interested in joining their team of 2,700 diverse individuals and accessing competitive rewards and benefits, all while knowing you are part of a greater movement, then apply today!

About the workplace

As the Director, Cloud Engineering, you will be responsible for leading and managing cloud infrastructure, cloud solutions, and the development of cloud-based services at scale. You’ll provide leadership and vision across three key teams—SRE, DevOps, and Cloud Solution Architecture with a focus on developing robust cloud strategies, improving system performance, driving cloud migration, and ensuring the seamless integration of cloud technologies with business operations.

This is a permanent, full-time role that will enjoy hybrid working arrangements which can be fulfilled primarily from the Vancity head office location and your Lower Mainland based home office. This role may require you to work in-office at least once a week.

A typical day would involve:
• Lead and develop the SRE, DevOps, and Cloud Architecture teams by setting a clear vision, aligning team goals with business objectives, and fostering a culture of collaboration and innovation.
• Managing team performance, provide professional development opportunities, and oversee resource allocation to ensure projects are completed successfully.
• Provide oversight to design and optimize scalable, secure, and cost-effective cloud infrastructure, ensuring that cloud environments align with business needs.
• Lead and guide the cloud adoption, migration strategies, and manage cloud costs, implementing best practices and compliance standards to maintain a high-performing and secure cloud ecosystem.
• Focused on operational efficiency, the Director role is to identify gaps and implement best practices, ensure system reliability and availability, and lead incident response efforts. Drive automation and continuous improvement in cloud operations, monitoring, and scaling, minimizing manual efforts and reducing system downtimes.
• The Director will work closely with internal teams (engineering, product, and infrastructure) and senior leadership to ensure that cloud strategies are well-integrated into the organization’s broader objectives. The Director will also manage external relationships with vendors and cloud providers to ensure high-quality service and alignment with business needs.
• The Director will ensure that cloud architectures and operations adhere to industry security standards and regulatory compliance requirements (e.g. PCI, SOC, OSFI).
• This role will require great collaboration with the Security team to implement robust security measures, such as identity management, encryption, and vulnerability management, ensuring the integrity and confidentiality of cloud systems. This role will also lead the development of policies and practices that ensure continuous compliance and mitigate security risks across cloud environments
• The Director will keep the organization at the forefront of cloud technology by exploring and adopting new tools, platforms, and cloud-native solutions. Leading initiative to drive continuous improvement of cloud processes, promoting innovation, optimizing cloud operations, and ensuring that the company stays competitive and efficient in its cloud strategy.

You have:
• Bachelor’s Degree in Computer Science, Information Technology, Engineering, or a related field.
• 10+ years of experience in cloud engineering, infrastructure, or a related field with a deep understanding of cloud platforms, architecture, and development practices.
• 5+ years of experience in leadership roles, managing multi-disciplinary teams such as SRE, DevOps, and Cloud Solution Architecture teams.
• Proven experience in leading cloud transformation projects, including migrating on-premise infrastructure to cloud environments (AWS, Azure, Google Cloud). Experience in leading change management initiatives and collaborating with non-technical cross-functional stakeholders.
• Strong background in cloud-native architectures, microservices, containerization, and orchestration platforms such as Kubernetes and Docker.
• Strong expertise in cloud platforms (AWS, Microsoft Azure, Google Cloud), with hands-on experience in cloud architecture design, deployment, and management.
• Understanding of cloud security best practices, including identity and access management (IAM), encryption, compliance, and auditing requirements.
• Experience with DevOps practices, including CI/CD pipeline management, automation, and continuous monitoring.
• Proficient in managing infrastructure-as-code (IaC) tools such as Terraform, CloudFormation, or Ansible.
• Certified DevOps Engineer (e.g., AWS DevOps Engineer Professional, Google Cloud DevOps Engineer) is a plus.
• Deep understanding of site reliability engineering (SRE) practices, including monitoring, automation, incident response, and system reliability.
• Strong knowledge of agile methodologies
• Familiarity with cloud cost optimization and monitoring tools to ensure efficient resource usage and budgeting.

Certifications:
• AWS Certified Solutions Architect Professional or Azure Solutions Architect Expert (optional but beneficial).
• Certified Kubernetes Administrator (CKA) or Certified Kubernetes Application Developer (CKAD) (optional but beneficial).

You are:
• A subject-matter expert – you possess significant knowledge in your functional area and areas that can impact your work. You ensure to keep updated with the most relevant developments in your space.
• A Strong Communicator - you use your strong communication and interpersonal skills to provide highly specialized project delivery expertise and advice to technical and non-technical stakeholders
• Analytical & Decisive - with your strong problem solving and decision making skills, you can diagnose challenges and issues; develop innovative investigative solutions; and to assess risks and opportunities that may affect the information security team.
• A people leader - you have people leadership skills to manage a team of direct reports and support the technical/transactional activities and carry out people practices. You have the ability to be adaptable to manage and lead yourself and your team through change.

We value lived experience, so if you are interested in this role, we encourage you to apply even if you feel your skills don't perfectly align with those listed.

The salary range for this role is $121,000 to $181,200 annually. Base pay offered may vary depending on factors such as relevant qualifications, skills, previous experience, and internal equity. As part of our total rewards package, employees may also be eligible for our annual incentive program, subject to program eligibility requirements.

Posting Deadline: Posted until filled

A career at Vancity is more than just a job, you’re joining a tradition of change-makers who are creating lasting change for our communities. Beyond base pay, we offer a comprehensive total rewards package to ensure our employees are empowered to thrive:

We offer:
• We are the largest private-sector Living Wage Employer in Canada and have been consistently recognized as one of the Top Employers in Canada.
• Our permanent employees qualify for attractive benefit packages that can be customized and changed each year to meet their evolving needs.
• New employees receive between three to four weeks of vacation allowance per calendar year, and the number of vacation days grows
• In addition to the 10 statutory holidays in British Columbia, Vancity provides an additional three statutory holidays. We offer care days for periods of short-term personal illness or emergency family illness.
• We have flex credits for our health care & dental benefits offer three levels of coverage for you to select from. These benefits will also be effective immediately based on your hire date.
• We understand that retirement means different things to different people and at Vancity we will offer you a Defined benefits pension plan that pays you a retirement income for life.

At Vancity we’re committed to creating a welcoming and inclusive workplace to help our people and communities thrive and prosper. Diversity in our workforce is integral so that we can truly represent, understand and respond to our community needs and deliver on our member experience.

We are committed to providing an inclusive and accessible recruitment experience for all candidates. If you require any accommodations at any stage of the recruitment process, please reach out to our Talent Acquisition team at recruitment@vancity.com for confidential support. In-person assistance is also available. We will collaborate with you to ensure your needs are met promptly and effectively.",False,24 days ago,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DvvZvS_2AEZHuzn_vAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,YEAR
"Manager, Software Engineering-R-222485",Mastercard,http://www.mastercard.com/,LinkedIn,https://ca.linkedin.com/jobs/view/manager-software-engineering-r-222485-at-mastercard-3959128509?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"Our Purpose

Mastercard powers economies and empowers people in 200+ countries and territories worldwide. Together with our customers, we’re helping build a sustainable economy where everyone can prosper. We support a wide range of digital payments choices, making transactions secure, simple, smart and accessible. Our technology and innovation, partnerships and networks combine to deliver a unique set of products and services that help people, businesses and governments realize their greatest potential.

Title And Summary

Manager, Software Engineering

Internally this position is referred as - Manager, Software Development Engineering - Decision Management Program

Overview
• The Decision Management program enables intelligent decision based products through streaming analytics with the ability to govern these decisions and manage their outcomes with business agility.
• This program leverages business rules & AI engines, a streaming big data cluster, an in memory data grids, APIs, & UIs to deliver real time decisions at global scale
• This person will be responsible for leading the team as well as stay hands on.

We are looking for a Manager to join our DMP team in Vancouver office.
• Are you a looking for a role with right balance of people management and hands-on with the code?
• Are you a strong technical programmer with experience leading a team?
• Are you passionate about making a difference in this world?
• Do you want to be part of a team which helps prevent fraud on every mastercard transaction in this world?

Role
• Lead and manage the team including performance review and technical guidance.
• Understand the business priorities and work on a roadmap so that business values are delivered.
• Manage your own time while collaborating with teammates to accomplish project goals.
• Collaborate with the architect and make sure the team is aligned with architecture guidelines.
• Apply best development practices to help team well designed, maintainable, testable, scalable, and secure code.

Essential Knowledge/Experience
• Strong People management skills.
• Strong programming skills with deep knowledge of Java.
• Strong leadership skills.
• Good multi-tasking abilities.
• Knowledge of Spring and other frameworks.
• Good knowledge of unit testing and mocking frameworks like junit, mockito or easymock.
• Good knowledge of SQL and experience working with Oracle.
• Experience working with high performance applications.
• Good problem diagnostic and creative problem solving skills.
• Strong organizational skills; able to manage multiple tasks within the constraints and timelines determined by business needs.

Desirable Skills
• Experience with IBM ILOG/ODM and Pivotal Gemfire Grid.
• Experience with Dockers, Kubernetes etc.
• Experience with Angular.
• BS in computer science or a related field preferred.

What we offer in return includes a beautiful view of the North Shore mountains, coffee that doesn’t stink, and colleagues that are as brilliant as they are likeable. We do cool things as a team including monthly craft beer tastings. Don’t forget the competitive salary, extended health benefits, flex-time schedules, and encouragement and support for professional development. We love it here, and we think you will too.

Mastercard is an inclusive equal opportunity employer that considers applicants without regard to gender, gender identity, sexual orientation, race, ethnicity, disabled or veteran status, or any other characteristic protected by law. In the US or Canada, if you require accommodations or assistance to complete the online application process or during the recruitment process, please contact reasonable_accommodation@mastercard.com and identify the type of accommodation or assistance you are requesting. Do not include any medical or health information in this email. The Reasonable Accommodations team will respond to your email promptly.

Corporate Security Responsibility

All activities involving access to Mastercard assets, information, and networks comes with an inherent risk to the organization and, therefore, it is expected that every person working for, or on behalf of, Mastercard is responsible for information security and must:
• Abide by Mastercard’s security policies and practices;
• Ensure the confidentiality and integrity of the information being accessed;
• Report any suspected information security violation or breach, and
• Complete all periodic mandatory security trainings in accordance with Mastercard’s guidelines.

Pay Ranges

Vancouver, Canada: $127,000 - $203,000 CAD

R-222485",False,6 days ago,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DQyiCshv8ZBgwRFSxAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,
"Project Manager, Infrastructure | Engineering Firm | Vancouver – Outpost Recruitment",confidential,,Outpost Recruitment,https://outpostrecruitment.com/job/project-manager-design-engineering-firm/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"Leading civil design engineering firm is seeking a Project Manager to join their growing transportation division. Salary range is $110,000 - $140,000. Outpost Recruitment is excited to work with our client on this full-time permanent role.

Responsibilities of Project Manager
• Leading civil engineering design work, from the conceptual level through to detailed construction drawings
• Acting as the key contact on projects working with stakeholders, consultants, contractors, and support staff
• Engaging in active business development
• Preparing proposals and reports in coordination with our Proposal Team
• Developing project schedules and coordinating resources
• Monitoring budget and progress on projects
• Training and mentorship of our Project Managers and design team
• Undertaking quality control procedures and monitoring design standards on completed work
• Project Manager will deliver infrastructure planning, design and construction services for linear infrastructure (water, storm, sanitary), streets and transportation, and water resources assignments.
• You will play a lead role in a talented and diverse team of Engineers, Project Managers, Designers and Technologists and apply your leadership skills to deliver transportation projects.
• You will work with our experienced Project Managers and our talented engineering team to ensure we meet our client needs. This is an excellent opportunity for advancement. You will utilize your excellent client networking and business development skills to secure new business opportunities while maintaining strong relationships with our existing clients. You have progressive experience working on project teams and place a high importance on quality work.

Qualification of Project Manager:
• Project Manager will have 10+ years of related experience in local municipal engineering project delivery.
• Documented experience with local public sector clients is an asset.
• Registration as a P.Eng. with EGBC, an AScT with ASTTBC, or equivalent (Vancouver position)
• Registered as a Professional Engineer with APEGA, or eligible for registration (Edmonton position)
• Valid Class 5 Driver’s License and personal vehicle
• Exceptional project management, design, and time management skills
• Demonstrated team management and delegation skills
• Demonstrated business development skills
• Proven conflict resolution capabilities
• Strong communication and time management skills and ability to work concurrently on several different projects
• Excellent attention to detail to consistently produce accurate, high quality work
• Confidence to lead assignments with minimal supervision

Benefits:

People come first, you will achieve support with education, mentoring, and growth opportunities you need to build an interesting career. As an employee-owned firm, we create a clear internal growth path that can keep up with even the most ambitious professionals. Whether it’s soccer or coffee clubs, hockey pool, lunchtime yoga or movember, everyone can get involved in their own way.
Ideal Candidate:

Only candidates with authorisation to work in Canada will be considered.

Please clearly highlight relevant work experience, project overviews and project scale ($) in your resume.",False,4 days ago,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DWG-RsqoCrvCps5_zAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,YEAR
Civil Engineer - Project Manager,Spait Infotech Private Limited,,Indeed,https://ca.indeed.com/viewjob?jk=ee951ea2ce0f81f3&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"About the Role

We are seeking an experienced Civil Engineer – Project Manager with 5 to 10 years of experience to oversee and manage infrastructure and construction projects. The ideal candidate will have a strong technical background in civil engineering, project planning, and stakeholder coordination, ensuring that projects are delivered on time, within budget, and in compliance with Canadian standards.

Key Responsibilities
• Lead the planning, design, and execution of civil engineering projects, including roads, bridges, commercial buildings, and municipal infrastructure.
• Develop and manage project schedules, budgets, and resource allocation to ensure successful project delivery.
• Coordinate with clients, contractors, regulatory bodies, and internal teams to streamline project workflows.
• Oversee quality control, safety, and compliance with Canadian Building Codes and environmental regulations.
• Prepare and review engineering drawings, technical reports, contracts, and procurement documents.
• Conduct risk assessments and feasibility studies to ensure project sustainability.
• Supervise on-site construction activities, resolving any technical or operational issues that arise.
• Implement cost-saving strategies while maintaining project quality and efficiency.
• Ensure timely reporting and documentation of project progress to senior management and stakeholders.

Qualifications & Skills
• Bachelor’s Degree in Civil Engineering (Master’s degree is an asset).
• 5 to 10 years of experience in project management for construction or infrastructure projects.
• P.Eng. certification or eligibility for licensing in Canada is preferred.
• Proficiency in AutoCAD, Civil 3D, MS Project, and Primavera P6.
• Strong knowledge of construction contracts, budgeting, and scheduling methodologies.
• Experience in municipal, commercial, or industrial project management.
• Excellent leadership, communication, and problem-solving skills.
• Familiarity with green building standards and sustainable engineering practices.

Job Type: Full-time

Pay: $106,574.00-$148,993.00 per year

Schedule:
• 8 hour shift
• Monday to Friday

Work Location: On the road",False,3 days ago,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DIlrKzCro06Pkm-ziAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,YEAR
Head of Deep Learning Research,Picovoice,https://picovoice.ai,LinkedIn,https://ca.linkedin.com/jobs/view/head-of-deep-learning-research-at-picovoice-4182895750?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"A steadily growing and profitable AI startup seeking a world-class leader to spearhead its deep learning research efforts. This is not a role for the complacent. It’s for those who thrive on solving vague and non-trivial problems under tight deadlines. You’ll work directly with our CEO and technical founder.

🎯 Required:
• Deep expertise in deep learning theory, applications, and limitations
• Proven leadership in research teams
• Hands-on experience with PyTorch and Python

🚀 Preferred:
• Published in NeurIPS, ICML, CVPR, or ICLR
• Experience with C and CUDA for low-level optimizations
• Knowledge in Speech Recognition, TTS, Speaker Recognition, or Language Modeling

💰 Competitive salary and meaningful equity in a high-pressure and high-performance environment.",False,6 hours ago,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DxAVDjQxk9ccqhKPkAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,
Process Design and Engineering Director,Saltworks Technologies Inc,https://www.saltworkstech.com,BeBee,https://ca.bebee.com/job/8f9b7b1e23ffe2b25e54404dc83e62ea?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"About Saltworks Technologies Inc

Saltworks Technologies Inc is a global leader in industrial desalination and lithium refining processes. Our technologies produce clean water from waste streams and refine lithium to support global energy transition initiatives.
The Role Description

We are seeking a highly skilled Process Design and Engineering Director to join our team. This role offers a clear pathway to leadership positions within the company and provides exceptional career opportunities for driven professionals.

In this role, you'll be responsible for leading process design and development for lithium recovery and desalination plants. You'll work alongside industry specialists and pioneers in the field who are dedicated to training and mentoring the next generation of innovators.
• Lead and mentor a team of engineers, providing technical direction, fostering collaboration, and ensuring successful project execution.
• Develop and implement process design and development strategies for lithium recovery and desalination plants.
• Collaborate with cross-functional teams to drive business growth and expansion.
• Evaluate and select optimal process devices and specifications for technology selection and economic feasibility.
• Drive product innovation by leading the design and development of new solutions in clean technology.

This role requires a relevant degree in Chemical Engineering, Process Engineering, Petroleum Engineering, or Integrated Engineering, with significant experience in process design and leadership. The ideal candidate should have 8+ years of post-graduation experience in process or chemical engineering within industrial environments, specializing in design, testing, and operations.
Benefits

We offer a competitive compensation package that includes medical, dental, vision, RRSP matching, life insurance, AD&D coverage, and an education allowance. We also provide opportunities to advance technically or in leadership roles, a culture that supports safety, innovation, learning, diversity, and teamwork, fun social activities, and company events.",False,1 day ago,"Richmond, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3D0NxMnem-pP-mO2GyAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,
Civil Engineer Project Manager,BBA,,Indeed,https://ca.indeed.com/viewjob?jk=83ffbeb0911ad194&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"Type of position: Regular

Your future role on our team

As a Civil project Manager, you will be a key part of our specialised Civil/Structural and Geotechnical engineering team in Vancouver, BC. Your role on the Vancouver team will involve both technical execution and leadership, following a seller-doer model—leading projects, developing client relationships, and contributing to business development efforts.
You will take ownership of mid-sized projects in the mining, renewable energy, chemical, and heavy industrial sectors, guiding them from concept to execution while also being hands-on in technical work.

With us, you’ll get the opportunity to…
• Lead the delivery of studies and detailed engineering mandates for heavy civil projects, ensuring high-quality technical solutions.
• Act as the proposal lead, preparing technical proposals, defining project scope, and engaging with clients to secure new work.
• Participate actively in business development, working closely with our leadership team to identify and pursue strategic opportunities.
• Review and approve engineering design packages including reports, studies, estimates, budgets, schedules, drawings, calculations, specifications, quotations, proposals, presentations;
• Take a hands-on approach to project execution, balancing leadership with technical contributions.
• Mentor and support junior engineers and project leaders, fostering their technical and leadership growth.
• Supervise and commission engineering solutions, including site inspections and contractor coordination.
• Engage in risk management and project performance tracking, communicating results to clients regularly.

Do your qualities and values match our corporate culture?
• Strong commitment to safety and quality.
• Client-focused with excellent communication and attention to detail.
• Results-oriented with strong organizational and planning skills.
• Ability to work independently and collaboratively in multidisciplinary teams.
• Business acumen, capable of supporting proposal development and strategic decision-making.
• Excellent communication and interpersonal skills, both with clients and internal teams.

Overview of certifications and job requirements
• Bachelor’s degree in Civil Engineering (Master’s degree is a plus)
• Experience in heavy industrial, mining, or renewable energy projects is preferred.
• Proven ability to lead projects and act as a proposal lead in client engagements.
• Willingness to travel (20% to 40% of the time annually).
• Proficiency in reading technical drawings, site supervision, and safety standards.
• Strong technical writing skills for reports and proposals.

An overview of BBA’s total rewards
• Competitive salary ($118,000-$144,500) with an annual bonus program
• Group insurance (including short- and long-term disability) starting day one
• Pension plan, vacation, sick leave, and onsite mobility premium
• Flexible hybrid work model (2–3 days in office)
• Professional growth opportunities, training, and innovation project participation
• Employee referral program and cellphone plan benefits
• Supportive, diverse, and knowledge-sharing work culture

At BBA, you get many benefits
• Long-term hiring (not just project-based)
• Interesting growth opportunities to match your ambitions
• A collaborative team that shares its ideas and knowledge
• Custom training and development plans
• A corporate culture that values expertise
• Participation in innovation projects

About BBA
For over 40 years, we’ve been pushing the boundaries of engineering to serve our clients in the Energy and Natural Resources sector. At BBA, we develop innovative, flexible and sustainable solutions, from strategy to execution. BBA is one of Canada’s leading private consulting engineering firms, focused on practice (PCB), with a network of 18 offices. Our teams work closely to deliver projects that shape tomorrow’s industry at the local, national and international levels.

Our goal is to ensure a diverse and inclusive work environment. We do everything we can to build a workplace where all of our employees want to excel and where they feel respected, heard and valued. Every day.

Our people’s passion and excellence make BBA one of Canada’s Best Managed Companies.
We have unique talents, and we’re committed to providing a workplace where you can be yourself. Job postings are written in gender-neutral language.
Learn more about us by visiting our LinkedIn page and join the networks of our talent attraction specialists to speak with them directly.",False,4 days ago,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3D-Zc5XsydfqyoS7X9AAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,YEAR
Senior to Principal Coastal Engineer (All Locations),BGC Engineering Inc.,https://www.bgcengineering.ca,LinkedIn,https://ca.linkedin.com/jobs/view/senior-to-principal-coastal-engineer-all-locations-at-bgc-engineering-inc-3864370763?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"• This position can be based in any of our North American BGC offices with occasional travel to other offices and project locations.**

About Us

BGC Engineering Inc. (BGC) is an international applied earth sciences professional services firm. We are proud of our talented team of over 700 employees, spanning the fields of Engineering, Geoscience, Software, Geomatics, Data Science, Accounting, Administration, Health & Safety and Human Resources.  Alongside our clients and industry partners, BGC works collaboratively as ‘One Team’, dedicated to solving the world’s most critical applied earth science challenges. BGC has offices located across Canada, the United States, Chile, the Dominican Republic, and Australia.

Our flat management structure creates a culture of innovation, excellence and transparency and a casual, dynamic and inclusive work environment. BGC prides itself on offering training and mentoring opportunities to further our employees’ professional growth as well as social and wellness activities that contribute to the connection and wellbeing of our team.

We believe in One Team, Excellence, Curiosity, Common Sense and Clarity.

The Role

BGC is seeking an experienced Coastal Engineer to be part of our newly developed coastal group. The successful candidate will work in multi-disciplinary teams related to surface water, geohazards, geophysics, soil mechanics, climate change, cryology, and earth observation/data science. The role will require technical leadership, business development, mentorship to other BGC team members and advancing innovative practice and use of new technologies. The successful candidate will oversee technical expertise in multiple areas of marine and coastal engineering including, but not limited to: geomorphology and sediment transport, coastal vulnerability and flooding assessments, coastal restoration, nature-based solutions and design and development of coastal infrastructure.

This position will preferably be based in one of our North American BGC offices with occasional travel to other offices and project locations.

Responsibilities
• Lead business development initiatives and assist in the development and execution of BGC’s coastal engineering strategy.
• Assist in the continued development of the coastal processes and morphology team.
• Train, mentor, and supervise technical work of other staff.
• Work with client and partner representatives.
• Promote BGC vision, values and culture amongst BGC staff.
• Travel as required, which could occasionally include extended shifts at remote work sites and visits to other BGC offices.

Required Education, Experience, And Competencies
• Bachelor's degree in Geological or Civil Engineering or a related field.
• Post-graduate degree in Coastal Engineering (or similar fields) preferred.
• A minimum of 10 years’ relevant post-graduate work experience in consulting or industry.
• Professional status required: P.Eng., PE., P.Geo.
• Desire to collaborate and contribute to projects globally while helping to develop and expand our client-base in the coastal engineering industry, in line with BGC’s strategic direction.
• Strong leadership, analytical and project management, and communication skills.
• Experience in projects in Canada or the United States is desired, exposure to projects in the arctic or Australia would be an additional asset.

Position Requirements

Drug & Alcohol Testing

To ensure we meet our client’s compliance requirements and our workplace health and safety commitments, BGC has a drug and alcohol policy that applies to this position. The policy states that an employee may be required to take a drug and alcohol test prior to engaging in field work. This testing could be requested within an employee’s first week or in the future, as required. It is important to note that some clients also require random drug and alcohol testing, and/or testing in the event of a health and safety accident or incident.

Driver’s License

BGC requires that employees have a valid driver's license, and that employees can drive a field pickup truck. Upon hiring, BGC will require a driver’s abstract to allow for a safety review of your driving history.

Travel and Vaccination

BGC is committed to maintaining a safe work environment to ensure the health and safety of employees while on business travel and during field assignments. To meet travel and client requirements, employees may be required to receive vaccinations such as yellow fever, COVID-19, malaria, etc. If you require an accommodation or wish to discuss your situation, please contact Human Resources. BGC requires that you have a current passport for this position.

Company Benefits

BGC offers our employees the following:
• Our ‘One Team’ culture supporting health, wellness, safety and diversity
• Comprehensive benefits package
• Health, Dental and Vision coverage
• LTD, Life, AD&D and Business Travel Insurance
• Employee Assistance Program
• Maternity/Paternity leave top ups
• Professional development and mentoring opportunities
• Flat management structure
• Flexible workplace with office and home arrangements
• Social and wellness activities
• Casual and professional work environment

The estimated base salary range for this position is $125,000 - $250,000 CAD per annum, however base pay will be commensurate with job-related knowledge, skills, and experience. BGC's compensation package also includes a training allowance and a comprehensive medical and dental plan.

Equity, Diversity and Inclusion

BGC strives to create a workplace where equity, diversity and inclusion are embedded throughout our workplace culture and practices. Join us in our commitment to honour individuality, ensure fairness, and create a welcoming environment for everyone. As an equal opportunity employer, we encourage applications from all candidates, including those experiencing inequity such as racialized individuals, Indigenous People, women, people of diverse sexual orientations, identities and expressions, veterans, individuals with disabilities, people of all faiths, nationalities, marital status, ages, and family status. For assistance or accommodation with your application, please contact us at careers@bgcengineering.ca.",False,28 days ago,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DQatHRc6vnhagFhNSAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,
Assistant Director of Engineering,COREcruitment,https://www.corecruitment.com,Learn4Good,https://www.learn4good.com/jobs/vancouver/canada/management_and_managerial/4024402620/e/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"Director of Engineering

Location:

Vancouver, BCSalary: $90,000 - $95,000

Located in the heart of the city, my client is seeking a Director of Engineering to oversee and enhance the maintenance and operational efficiency of their luxury property. This role offers the opportunity to lead a dedicated team and implement innovative solutions to uphold the hotel's high standards of excellence and guest satisfaction.

Key Responsibilities:

Stay informed and adhere to all departmental policies, procedures, and standards.

Ensure superior standards are consistently maintained daily.

Act as the Director of Engineering in their absence and collaborate with the Executive Team to achieve the hotel’s goals.

Oversee the hotel's maintenance and preventative maintenance program.

Maintain division standards and control objectives.

Establish and implement annual objectives for the Engineering department.

Provide continuous training and development to ensure team skills are up to date.

Respond to daily work orders promptly, ensuring proper follow-up and completion

Key Requirements Minimum 5 - 10 years expereince in a similar position for a luxury property

Strong familiarity with project management and collaborative software

Proven knowledge of a variety of heating and cooling systems

Ability to design and impliment operating standards and procedures

Strong knowledge of plumbing, electrical, fire and local mechanical codes

Interested? Please send your resume to Declan today!

NOTE:

Please note that only shortlisted candidates will be considered, and candidates must have the right to live and work in Canada to be considered

About COREcruitment

COREcruitment are experts in recruiting for Hospitality, Catering, Leisure, Retail, FM, Property and Construction sectors. We currently have over 1350 live roles across the UK, Middle East, Europe, North America, South East Asia, Africa and Australia.",False,7 days ago,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DS98pr1SAiP-uqgCVAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,YEAR
Development Engineering Manager,WhiteWater West-,https://www.whitewaterwest.com,Indeed,https://ca.indeed.com/viewjob?jk=d5aab4b314259260&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"WhiteWater makes products, but we are a service business at our heart, which means we are a people business. In this way, we excel and create value for our clients by listening to their needs, collaborating to develop solutions, problem-solving and attending to the details. Our culture, as you would expect, reflects these traits. We are a diverse group of experts, from creative designers to talented engineers. Whatever expertise we bring from all over the world, we listen and learn from each other because we are aligned with a clearly understood purpose. Together, we create fun for families globally.

Interested in starting an exciting career with WhiteWater? Apply today!

Position Manager, Development Engineering

Shift Full-time, 40 hours per week

Department Engineering

Location Richmond, B.C

Reports to Director, Engineering

Purpose:

The Development Engineering Manager provides oversight to a team of staff within the organization’s engineering department who are responsible for the development of new products, as well as the advancement of existing products. This team shall consist of both professional and non-professional engineers, as well as technologists, who are involved with complex technical assignments relating to the development and deployment of new products.

The Development Engineering Manager will work closely with Product Managers and other stakeholders to develop safe & fun, high-quality, reliable products in accordance with the Stage Gate process and published development schedules. The Development Engineering Manager shall participate in long-term planning and decision-making relating to the acceptance or rejection of proposed new products. The Development Engineering Manager recruits, mentors, supports and motivates the team. The Development Engineering Manager plans the department’s product assignments and resourcing requirements with respect to appropriate disciplines and staff levels, as well as establishes development schedules and budgets. The Development Engineering Manager also acts as a representative of the team and as a liaison with customers, both internal and external.

Essential Responsibilities
• Leads a team of technicians, designers and engineers within a product-focused environment to develop state-of-the art products for the waterpark industry.
• Leads the team to innovate new products, with the focus on providing safe, fun and thrilling waterpark experiences.
• Responsible for ensuring products are developed in accordance with WhiteWater’s Stage Gate process; meeting or exceeding applicable safety, regulatory, quality, manufacturing, engineering, installation, and ease of use requirements.
• Responsible for establishing and leading multiple cross-functional core teams in the development of new and existing products.
• Responsible for ensuring development teams are appropriately staffed and funded to achieve target Stage Gate milestones and deliverables.
• Work with Product Managers and other stakeholders to prioritize and schedule the development of new and existing products.
• Responsible for ensuring development schedules and budgets are prepared and maintained for products under development.
• Participate in annual budgeting relating to the development of new and existing products.
• Responsible for reviewing product designs to evaluate risks, costs, estimated time to market, and fulfilment of requirements.
• Responsible for leading the team to manage and mitigate risks to ensure products meet or exceed WhiteWater’s standard for safety and quality.
• Responsible for the oversight of prototype activities conducted within the organization’s facilities to ensure appropriate workplace safety measures are in place and followed.
• Accountable and responsible for the team’s ability to achieve set metrics.
• Assist pre-contract and sales with preparation of proposals, engineering estimates, pre-contract engineering schedules and pre-contract designs.
• Conducts oneself and fully participates as an active member for the engineering leadership team which leads, act as role models, manages and sets expectation for all engineering staff members.
• Manages the team’s overhead costs to budget.
• Identify, support, and cultivate lean initiatives and opportunities for continuous improvement of the product development process within the organization.
• Collaborate with other departments to ensure operational efficiency.
• Other duties as set forth by management.

Qualifications and Experience
• Registered Professional Engineer in Canada (P.Eng.) or US (P.E.) preferred.
• Minimum education requirement - Bachelor of Engineering or Applied Science degree from a Canadian university or foreign equivalent.
• Minimum of 10 years’ experience in a product development environment, with 4+ years’ experience managing people.
• Must be familiar with Product Development and Stage Gate processes.
• Hands-on experience conducting, leading and participating in the certification and commissioning of amusement rides, or machinery of similar complexity.
• Advanced understanding of industry accepted risk assessment techniques.
• Experience with the design and manufacturing of metallic, plastic and composite parts.
• Demonstrable leadership, mentoring, engineering and troubleshooting skills.
• Background in mechanical design, product development, or manufacturing.
• Proficiency in Microsoft Office suite.
• Working knowledge of SolidWorks and Product Data/Lifecycle Management systems.
• Must be legally eligible to work in Canada.
• Must be able to travel world-wide without restrictions.

Leadership and People Management
• Mentor, motivate and coach team members toward professional and personal development by setting clear expectations, providing feedback, and conducting performance reviews.
• Demonstrate sound approaches to business problems with a consumer/customer mindset.
• Facilitate change management and integration best practices.

Competencies, Skills & Abilities:
• Ability to provide leadership in a fast-paced environment where issues are constantly surfacing with changing priorities.
• Exceptional interpersonal skills with the ability to develop and maintain effective internal and external working relationships at all levels of the organization.
• Excellent leadership, analytical, and critical thinking skills.
• Ability to quickly come up to speed on the business and industry.
• Proven ability to work well with diverse groups spanning all cultures.
• Demonstrate professional behavior with internal and external stakeholders.
• Excellent time management, organizational and prioritization skills.
• Anticipate problems proactively and plan contingencies.
• Tackle issues with tact and sound reasoning.
• Accomplish goals with drive and energy, while balancing attention to the bottom line.
• Strong sense of accountability and meeting scheduled obligations with a commitment to excellence.
• Write and present opinions effectively; adjust to fit the audience and the message.

WhiteWater Competencies:
• Accountability – We do what we say
• Collaboration – We work well together
• Customer Focus – We know and respond to our customers
• Communication – We listen to and understand each other
• Authenticity – We are honest and trust each other
• Resilience – We deal effectively with pressure, are persistent and optimistic
• Flexibility & Adaptability – We are willing and able to respond to changing circumstances

WhiteWater is proud to be an equal-opportunity employer. We celebrate the diversity of all employees and applicants and are strongly committed to creating an inclusive environment for everyone.

We thank all the candidates who take the time and energy to apply. Given the volume of applications, it makes responding personally to each applicant difficult, but please know we are grateful for your interest. We look forward to connecting with you through this search or future ones. All the best in your job search.",False,4 days ago,"Richmond, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Do1my0Ex3w_QSwh0AAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,YEAR
Project Manager (Engineering) - Vancouver or Toronto,Giffen Consulting,https://giffenconsulting.com,ZipRecruiter,"https://www.ziprecruiter.com/c/Giffen-Consulting/Job/Project-Manager-(Engineering)-Vancouver-or-Toronto/-in-Vancouver,BC?jid=bdf82fe5861b3dcb&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic","Salary: $100,000-$140,000

Position Overview

Giffen Consulting Ltd. (Giffen) is looking to add a Project Manager to an already accomplished project delivery team. We are looking for an individual with a mining and heavy industrial background to join us on a full-time basis. This is an Intermediate level position that offers lots of opportunities for career progression. It is expected this candidate can report three (3) days a week to one of our offices in Vancouver or Toronto.

About Us

Giffen is a Canadian company, with offices in Vancouver, BC, and Toronto, ON. that provides fit-for-purpose engineering and project delivery solutions, specializing in the mining, utility, and heavy industrial sectors.

At Giffen, we take pride in our ability to deliver flexible strategies that are tailored to the specific needs of our clients. We value relationships above all else within our team and with our clients. We hold our team to the highest level of accountability to ensure we provide tailored solutions to successfully execute our clients projects.

We believe that open communication is the key to fostering reliable and lasting relationships within our company and with those who we conduct business with.

Key Responsibilities

The ideal candidate will be able to:
• Maintain and develop strong client relationships throughout the project lifecycle, including close-out. Identify, document, and communicate client requirements while effectively managing multiple stakeholders.
• Proactively resolves performance, scope, cost, and schedule issues with the Client as they arise.
• Ensure projects are managed in accordance with contract terms and conditions.
• Clearly define project scope and ensure compliance with contract requirements. Manage change control processes and project interfaces while monitoring performance to identify and mitigate issues early.
• Oversee all project scope elements, develop resource and financial plans, and manage design, procurement, and construction activities to align with the project schedule.
• Prepare accurate project estimates and collaborate with the Project Services Team to establish cost reports. Monitor and control all cost aspects, including forecasting, approvals, trend identification, and cost-saving opportunities.
• Define project quality requirements per the Project Quality Plan. Develop a project schedule that allows work to be executed efficiently while ensuring compliance with Company policies and procedures.
• Provide clear and focused leadership to the project team, creating a vision for success and a strategy to achieve key milestones and objectives.
• Ensure accurate and timely progress reporting to both the client and internal teams. Continuously monitor communication channels between project staff, the client, and third parties, implementing improvements as needed.
• Identify project risks and opportunities, ensuring timely resolution and proactive mitigation strategies.
• Set clear objectives for the design team and ensure adherence to the client's Basis of Design, regulations, and codes.
• Ensure all HSE procedures are followed and that project participants understand and document compliance with safety requirements.

Qualifications+ Experience
• 10+ years of progressive experience in a multidisciplinary engineering environment (EPC, EPCM, IPD, etc.)
• Experience with complex projects values over $10M
• Familiar with greenfield and brownfield mining / heavy industrial projects
• Knowledge of industry standards, regulations, and codes of practice
• Experience with equipment selection and sizing for switches, transformers, and power and load distributions
• Bachelors Degree/Diploma in Engineering or Construction Management from an accredited university or similar
• Registered as a Professional Engineer or Applied Science Technologist in Canada or eligible to register
• Project Management Professional (PMP) designation with the Project Management Institute (PMI) is not required but is considered an asset
• The MMCD Certified Contract Administrator (MMCD CCA) designation is not required but is considered an asset

What We Offer

Giffen is an open, welcoming, accepting, and positive space for all our employees and contractors. Here are some of the perks of working for us!
• Connect through monthly continuous performance management meetings
• Encourage continual learning through courses and conferences
• Support professional designation certification
• Invest in our people through a variety of corporate programs
• Host company-wide social events

Why Join Our Team?
• Small, growing team
• Competitive compensation package including RRSP matching program
• Employee Health Spending Account
• Short + Long-Term Incentives
• Flexible Work-From-Home option
• Offices in Gastown, Vancouver & Downtown Toronto",False,21 hours ago,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DJAqiW9WvD-wQ8ps4AAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,
Railway Systems Lead,RTSE Solutions,https://rtsesolutions.com,LinkedIn,https://ca.linkedin.com/jobs/view/railway-systems-lead-at-rtse-solutions-4180592455?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"We are seeking a dynamic and experienced Railway Systems Lead to join our innovative team. In this role, you will play a crucial part in leading complex upgrade projects and ensuring the success of our railway projects, working with a dedicated team of professionals to drive excellence and innovation in the industry.

Responsibilities and Skills
• Possess a strong understanding of on-board and wayside systems that govern a railway network.
• Possess a strong understanding of INCOSE Systems Engineering principles.
• Provide leadership and direction in complex railway upgrade projects and resolve issues involving the design of multiple stakeholders.
• Ensure the technical deliverables are distributed to the correct resources by facilitating design review processes.
• Provide a holistic picture of the status of all systems that compose the project and ensure their developments are coordinated.
• Lead and chair meetings and workshops with project stakeholders.
• Manage a risk register and ensure critical issues are escalated throughout the business.
• Maintain strong communication with the stakeholders, client, and project team.
• Research and develop business cases on areas that need improvement within a client organization.
• Foster strong communication channels with stakeholders, clients, and project team

members to ensure alignment and address concerns proactively.

Qualifications
• Bachelor’s degree in Engineering.
• Registered Professional Engineer (P.Eng.).
• Experience in managing projects in complex multi-threaded environments.
• Minimum 10 years of experience in Railway projects.
• Strong understanding of international railway standards.

Apply for the position by filling out the form on the company website: rtsesolutions.com/careers/",False,3 days ago,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Dx7gLSsq6NpYwhhF8AAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,
Engineering Division Director,Accoravillage,https://accoravillage.com,BeBee Canada Meet Opportunities,https://ca.bebee.com/job/3a30c2599e700a2ee4e9367862dcc7cc?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"Why Choose RAM Consulting:

As a leading project delivery firm, we offer a dynamic and challenging work environment that fosters growth and development.

Benefits:
• Tuition Reimbursement and Career Planning;
• Extended Health Benefits;
• Ability to work on North America's largest projects;
• Be part of an innovative technical team;
• Grow & develop your career;
• Join an inclusive and diverse culture;
• Annual Performance and Salary Reviews.",False,5 days ago,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3D41eJ2E32yrmkEIDTAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,
Senior Project Manager - Buildings,Colliers Project Leaders,,Ladders,https://www.theladders.com/job/senior-project-manager-buildings-colliersprojectleaders-vancouver-bc_75037828?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"Overview

At Colliers Project Leaders, we deliver capital project solutions to fulfill our clients' needs across the built environment. The work we do makes a difference in communities and for the people who live there. We have a passion for it.

Our commitment to realizing our clients' vision inspires us to look beyond the immediate - to the possibilities of what we can achieve together. We are 18,000 projects and counting - improving lives and helping shape the growth of sustainable, progressive and inclusive communities.

Your Role

Join our team as a Senior Project Manager with the Vancouver Business Unit.

We're looking for outstanding project leaders who are organized, have a keen eye for details and have led and managed complex projects from start to finish - on time and on budget with our British Columbia business unit. You're good at building strong, trusting client relationships and have a knack for bringing the right people together to come up with innovative ideas and solutions.

To be successful in this role you will bring a wealth of experience leading projects and be able to demonstrate a portfolio varying in scope and complexity with depth in project delivery focusing on building and facility project delivery specifically in healthcare, education or mixed-use evironments.

Responsibilities
• Develop strong client relationships and act as the client's single point of contact throughout the project to achieve the client's goals and objectives
• Work on a number of facilities and building projects, varying in size and scope
• Ensure that client expectations and satisfaction are met or exceeded on all projects and the client's best interests are represented with respect to contractual and technical issues
• Select and organize project teams and establish levels of authority and lines of communication
• Lead the control of project related documents and deliver all work in accordance with Colliers Project Leaders Quality Management System and procedures
• Chair project and site meetings, find resolution to issues and coordinate between multiple stakeholders
• Maintain contact with existing and prospective clients and respond to business development and sales opportunities with support from the Business Development Team, Principal or Regional Vice President
• Regularly report on project status by means of schedule updates, meeting minutes, financial records and other reports
• Provide oversight and leadership to the change management process, payment certificates and other contract or project related administrative documents

Qualifications
• A minimum of 10 years of experience as a Project Manager, representing owners to multiple stakeholders in the delivery of projects of varying size and scope in sectors such as institutional, healthcare, educational or commercial mixed-use
• A university degree or diploma in engineering, architecture or quantity surveying (or an equivalent combination of academic and practical experience)
Strong knowledge of various types of construction methodologies, project management models and financial management, as well as building codes, contract law and relevant legislation
• Effective leadership and organizational skills with the ability to effectively influence others and successfully resolve a variety of client, project and technical issues
• Excellent written and verbal communication and presentation skills
• Strong computer skills, including a working knowledge of scheduling (MS Project), word processing (Word) and spreadsheet (Excel) software applications

Approximate Base Salary Range for Role: $100,000 CAD to $145,000 CAD.

Base Salary pay ranges are determined by role, level, and location and reflects the minimum and maximum target for new hire base salaries for the position. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Annual bonus opportunities are in addition to base salary.

Don't have every single qualification? We know that some people are less likely to apply for a job unless they are a perfect match. At Colliers Project Leaders, we're not looking for ""perfect matches."" We're looking to welcome people to our diverse, inclusive, and authentic workplace. So, if you're excited about this role but don't have every single qualification, we encourage you to apply anyway. Whether it's this role or another one, you may be just the right candidate.

What you can expect:
• An opportunity to truly impact our communities
• A flexible work environment
• A comprehensive onboarding experience
• Significant professional development, training, and a mentorship program
• A paid volunteer day
• An environment where people feel welcome, heard and included, regardless of their differences
• And much more!

Join our team of difference-makers and help shape the growth of dynamic communities!

#LI-CD1

Disclaimer

Colliers Project Leaders is part of Colliers (NASDAQ, TSX: CIGI), a leading diversified professional services and investment management company, with more than 17,000 professional operating in 63 countries.

Colliers Project Leaders has suspended our COVID-19 vaccination requirement. In circumstances where our clients have a different COVID-19 vaccination policy, the Clients' requirements will supersede.

Colliers Project Leaders is an equal opportunity employer and celebrates diversity in its workforce. Colliers encourages applications from all qualified individuals and will accommodate applicants' disability-related needs, up to the point of undue hardship, throughout all stages of the recruitment and selection process. If you require a disability-related accommodation to participate in the recruitment process, please advise the assigned Talent Acquisition Business Partner.

Colliers Project Leaders standard recruitment process requires applicants to be subjected to formal background and reference checks prior to their hiring.",False,,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Daxf1GSN5DCFsGg60AAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,YEAR
Installation Service Manager,Sapphire,http://www.thenaturalsapphirecompany.com,LinkedIn,https://ca.linkedin.com/jobs/view/installation-service-manager-at-sapphire-4182675776?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"Sapphire is looking for individuals who share our core values:

Skilled - We set the standards by hiring and developing the best. All of our team members are experts in their fields.

Trustworthy - We deliver on our word. We value honesty over profits, building and maintaining trust with our team and partners.

Responsive - We are intentionally accessible and quick in our responses.

Passionate - No matter our role, we love what we do, and always work to provide the best results for our customers.

All in - Whether it's staying late to finish the job, getting the design done in time, or grabbing the plunger, our team is ready to do whatever it takes.

Fun - Whether we're on the job site or in the office, we're all about enjoying the ride together.

Our team is the driving force behind our success. We care about our people and we're committed to setting you up for success.

Job Summary

We are seeking a highly motivated and experienced Installation & Services Manager to join our dynamic audiovisual (AV) company. The ideal candidate will have a proven track record in leading diverse teams, managing complex projects, and fostering client relationships across multiple locations. This individual must possess strong leadership, technical expertise, and financial acumen to drive growth and ensure the successful execution of regional operations.

Key Responsibilities

Leadership and Team Management
• Lead, mentor, and manage teams, fostering a high-performance culture.
• Motivate employees, address performance challenges, and resolve conflicts to maintain a positive work environment.
• Develop and implement training initiatives to enhance technical and leadership skills.

Project Management
• Oversee multiple projects simultaneously, ensuring timely delivery and adherence to client requirements.
• Allocate resources effectively, manage schedules, and coordinate with stakeholders to maintain project momentum.
• Ensure project completion within budget while meeting quality and compliance standards.

Team Scheduling and Resource Assignments
• Develop and manage team schedules, ensuring adequate resource coverage for all projects and service commitments.
• Monitor workload distribution and adjust assignments to optimize team productivity and efficiency.

Technical Expertise
• Provide oversight for AV system installations, integrations, and troubleshooting.
• Stay up to date with emerging AV technologies, including video conferencing systems, display solutions, and control systems.
• Serve as the escalation point for complex technical issues, guiding teams through advanced troubleshooting.

Customer and Stakeholder Engagement
• Develop and maintain strong relationships with clients, acting as the primary regional point of contact.
• Address client concerns and provide expert advice to ensure high levels of satisfaction.
• Collaborate with other departments to deliver seamless customer experiences.

Budgeting and Financial Management
• Develop and manage regional budgets, forecasts, and financial reports.
• Monitor project financials, ensuring cost controls are in place and financial goals are achieved.

Quality Assurance
• Implement and enforce quality control processes to ensure high standards of project delivery.
• Conduct detailed quality checks and system testing to verify compliance with specifications and safety standards.

Strategic Planning and Innovation
• Contribute to the development of growth strategies and operational improvements.
• Identify opportunities for innovation and process optimization to enhance service delivery.

Qualifications and Skills

Experience Requirements:
• 7+ years of experience in the audiovisual industry, including roles in Project Management and Team Leadership.
• Relevant certifications such as AVIXA CTS, CTS-I, CTS-D, PMI PMP, or manufacturer-specific training preferred.
• Proven ability to lead and manage diverse teams across multiple locations.
• Strong technical knowledge of AV system integration, service, and troubleshooting.
• Exceptional project management skills, with the ability to manage competing priorities.
• Strong customer-facing communication and relationship management abilities.
• Budgeting and financial management experience.
• Excellent problem-solving and critical thinking skills.
• Ability to work independently and make informed decisions under pressure.
• Commitment to continuous improvement and professional development

Other Requirements:
• Valid Class 5 Drivers license
• Ability to lift up to 50 pounds, work on ladders, and perform tasks at height or in crawl spaces.
• An iPhone or Andriod smartphone with/ cellular data
• Project management (Scheduling, Planning, Stakeholder communication)
• Google Apps (Gmail, Calendar, Sheets, Docs)
• Steel toe-over-ankle boots

Travel Requirements:
• Ability to travel out of town - Typical 1 week/month
• Locally - Our projects take place across the Lower Mainland and project locations vary

How we will support you and your family:
• Career growth opportunities and continuous learning.
• Paid Vacation
• Sick Leave
• RRSP Matching
• Health Benefits
• Mileage
• All Travel Cost Paid
• Company Tools Provided
• Employee Milestone Program
• Employee Training & Development Program
• Company Social Events
• PTO During Christmas Office Closure",False,1 day ago,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DXZ3KmI68K2PytIKeAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,
"Engineering Manager in Back End (Bangkok based, relocation provided)",Agoda,https://www.agoda.com,LinkedIn,https://ca.linkedin.com/jobs/view/engineering-manager-in-back-end-bangkok-based-relocation-provided-at-agoda-3500670255?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"About Agoda

Agoda is an online travel booking platform for accommodations, flights, and more. We build and deploy cutting-edge technology that connects travelers with a global network of 4.7M hotels and holiday properties worldwide, plus flights, activities, and more . Based in Asia and part of Booking Holdings, our 7,100+ employees representing 95+ nationalities in 27 markets foster a work environment rich in diversity, creativity, and collaboration. We innovate through a culture of experimentation and ownership, enhancing the ability for our customers to experience the world.

Our Purpose – Bridging the World Through Travel

We believe travel allows people to enjoy, learn and experience more of the amazing world we live in. It brings individuals and cultures closer together, fostering empathy, understanding and happiness.

We are a skillful, driven and diverse team from across the globe, united by a passion to make an impact. Harnessing our innovative technologies and strong partnerships, we aim to make travel easy and rewarding for everyone.

Get to Know our Team:

In Agoda’s Back End Engineering department, we build the scalable, fault-tolerant systems and APIs that host our core business logic. Our systems cover all major areas of our business: inventory and pricing, product information, customer data, communications, partner data, booking systems, payments, and more. These mission-critical systems change frequently with dozens of releases per day, so we must employ state-of-the-art CI/CD and testing techniques in order to make sure everything works without any downtime. We also ensure that our systems are self-healing, responding gracefully to extreme loads or unexpected input. In order to accomplish this, we use state-of-the-art languages like Scala and Go, data technologies like Kafka and Aerospike, and agile development practices. Most importantly though, we hire great people from all around the world and empower them to be successful. Whether it’s building new projects like Flights and Packages or reimagining our existing business, you’ll make a big impact as part of the Back End Engineering team.

The Opportunity:

The Engineering Manager role at Agoda is one of the most significant and challenging roles at the company. The right candidate is both extremely hands on – technically excellent, with solid engineering principles – and exhibits strong leadership and people development skills. We are looking for world class development managers to lead one or more of our engineering teams.

In this Role, you’ll get to:
• Be hands on – its one of the job’s fundamental task, and most of our development managers are writing and reviewing code, giving expert level coaching and guidance to their engineers.
• It’s important to have a love of engineering and a passion for building things elegantly and at scale. Staying in touch with where the industry is going is crucial, and it’s important to have strong opinions about how systems should be architected, engineered, and maintained
• Do full stack engineering: you should have solid experience in all parts of the technology stack: infrastructure, client side, back end, performance, data, and others.
• Developing people – Despite our investment and belief in technology, people are still our greatest asset. The right candidate will have a keen interest in developing people: inspiring those around them so they can achieve their potential. Being able to bring A-players such as yourself from outside and integrating them into the business will also be important.

What you’ll Need to Succeed:
• Extremely proficient in at least 1 programming language (Java, Scala, C#)
• Strong experience in systems architecture – particularly in complex, scalable and fault tolerant distributed systems
• Demonstrable experience as a system owner with operational responsibility
• Proficient in lower level engineering (Garbage collection, context switching, threading)
• DevOps culture – Agility. Leanness. Automation. CI/CD
• Good understanding of application security
• Passionate about technology and the Internet
• Must have worked in a successful agile development team
• Must have run engineering teams before with 5+ direct reports
• Able to operate with autonomously: making decisions, setting KPIs, with a strong sense of ownership
• Practices data driven decision making

It’s Great if you have:
• Proficiency in more than one programming language

#sanjose #losangeles #sydney #melbourne #perth #brussels #saopaolo #vancouver #shanghai #beijing #shenzhen #copenhagen #helsinki #paris #hongkong #budapest #jakarta #dublin #telaviv #milan #rome #tokyo #kualalumpur #amsterdam #oslo #jerusalem #manila #moscow #barcelona #madrid #stockholm #zurich #taipei #istanbul #london #wroclaw #warsaw #rio #chennai #pune #toronto #austin #sydney #chichago #noida #delhi #seattle #hyderabad #gurgaon #newyork #bangalore #boston #bengaluru #berlin #mumbai #stockholm #barcelona #IT #4 #5

Equal Opportunity Employer

At Agoda, we pride ourselves on being a company represented by people of all different backgrounds and orientations. We prioritize attracting diverse talent and cultivating an inclusive environment that encourages collaboration and innovation. Employment at Agoda is based solely on a person’s merit and qualifications. We are committed to providing equal employment opportunity regardless of sex, age, race, color, national origin, religion, marital status, pregnancy, sexual orientation, gender identity, disability, citizenship, veteran or military status, and other legally protected characteristics.

We will keep your application on file so that we can consider you for future vacancies and you can always ask to have your details removed from the file. For more details please read our privacy policy .

To all recruitment agencies: Agoda does not accept third party resumes. Please do not send resumes to our jobs alias, Agoda employees or any other organization location. Agoda is not responsible for any fees related to unsolicited resumes.",False,7 days ago,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Dc4b2VznuXxIKdjeKAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,
Mechanical Manager,H.H. Angus and Associates Limited,https://hhangus.com,Indeed,https://ca.indeed.com/viewjob?jk=4bf44b6cd317b452&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"We are currently looking for a Mechanical Manager to join our growing company.

This is a great opportunity to join a dynamic team in a company with an excellent reputation in the engineering consulting industry. At HH Angus, we value our employees and strive to create a culture of learning, growth, and success. The Mechanical Manager reports directly to an Associate Director with extensive experience in our Healthcare Division and works with several team members who have a strong base of knowledge and industry experience.

HH Angus has been collaborating with building owners, architects, and contractors for many years to deliver projects in Vancouver and across the province. Completed projects include Royal Inland Hospital Phil & Jennie Gaglardi Patient Care Tower, Lions Gate Hospital power plant replacement, Penticton Regional Hospital David Kampe Tower Phase I, commissioning of the TELUS Kamloops Data Centre, Royal Jubilee Hospital Patient Care Centre and Fort St. John Hospital and Peace Villa. Current major projects include the decarbonization of Creative Energy’s downtown Vancouver district energy steam plant, compliance engineering for Royal Columbian Hospital Phases 2 and 3, the new Burrard Exchange office tower at Bental Centre and ongoing mission critical facilities work for Telus.

Our Vancouver office is located in Bentall Centre – in the heart of Vancouver’s vibrant downtown – with close proximity to public transit, restaurants, shopping and other amenities. We have an established team in this office with great chemistry, a friendly and welcoming environment, strong communication within the office and across the organization with excellent benefits and career development supports.

HH Angus has a long history in the healthcare industry, but even more than that, we have a reputation of satisfying clients who require solutions to complex projects. Our Healthcare Division works on a variety of healthcare facility projects, including public-private partnership (PPP or P3), acute care, long-term care, mental health, and rehabilitation hospitals. In this role, you will apply your technical engineering and project management skills to add value to our clients and individuals who rely on healthcare facilities for their well-being. You will have the opportunity to be involved with complex healthcare projects in BC as well as across Canada. For example, HH Angus is the lead engineering firm for the Cowichan District Hospital Redevelopment which is aiming to be the first all electric hospital in BC and first CaGBC Net Zero hospital in Canada.

Come Grow With Us!!

Responsibilities:
• Leads, manages, and mentors a team of engineers, designers, CAD staff, and project managers to deliver projects on a timely basis
• Provides clear communication on team skillset, resourcing and development to Senior Manager and Associate Director
• Primarily responsible for managing, retaining, and developing staff members
• Identifies and staffs projects, either directly or through Project Managers
• Acts as a primary relationship manager for a select group of clients
• Monitors status of projects through Project Managers
• Engages in performance management cycle for direct reports
• Responsible for project billings and expenses of team with manager review and approval
• Responsible for financial performance of the projects that they invoice for
• Approves time sheets of team members
• Actively participates in divisional operations meeting

Qualifications:
• University Degree in Mechanical Engineering
• P.Eng with EGBC
• 10 + years engineering consulting experience
• Strong relationship builder, able to resolve conflicts and foster positive team environment
• Experience developing and supporting team members with direct experience mentoring others to enhance growth and performance.
• Healthcare project experience an asset
• Knowledge of AutoCAD and Revit
• Forward thinking, eager to learn best practices, and contribute with innovative ideas
• Good accuracy and documentation skills
• Ability to collaborate and work effectively in a variety of teams, including multi-disciplinary teams
• Passionate about buildings and the built environment

The expected salary for this role is between $100,000 to $140,000 annually. Base salaries are determined considering several factors such as skills and competencies, experience, education, and internal and external competitiveness.

HH Angus is committed to providing an accessible work environment. Upon request during the recruitment process, HH Angus will accommodate applicants with disabilities. For more information on our Accessibility Program please refer to our Accessibility Policy.

We thank all candidates for their interest, but only qualified candidates will be contacted. We are an equal opportunity employer.",False,,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DrWXedepamQFet2aWAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,YEAR
"Executive Assistant - General Manager, Engineering & Public Works",City of Richmond,,LinkedIn,https://ca.linkedin.com/jobs/view/executive-assistant-general-manager-engineering-public-works-at-city-of-richmond-4181946749?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"The City of Richmond is a diverse and high performing values-based organization. Central working at the City, are the core values of People, Excellence, Leadership, Team and Innovation. These values define both the City’s culture, and the basic principles by which all staff operate. The City also places great emphasis on organizational development, with a variety of focus areas that ensure the ongoing strength of the corporate culture.

Reporting directly to the General Manager, Engineering & Public Works, this position provides administrative, analytical and tactical support and plays a key role supporting the divisional management team and the Senior Management Team, while embodying the City’s values in all aspects of work.

Key Responsibilities:
• Ensuring all administrative assistance required by the General Manager is provided, including screening calls, responding to emails, booking appointments, prioritizing items, and expense reconciliation.
• Liaising between divisional staff and the General Manager; providing advice and recommendations as to the appropriate course of action when the General Manager is unavailable.
• Coordinating meetings and workshops; preparing agendas and liaising with other departments as required.
• Composing, proofreading, editing, and finalizing a variety of documents and reports on behalf of the General Manager.
• Monitoring the status of all departmental reports going to Committee/Council meetings; ensuring report preparations are completed; coordinating any necessary internal preparatory meetings pre-Committee/Council meetings; coordinating all background information for the General Manager’s perusal prior to these meetings.
• Coordinating and tracking the review of documents submitted to the Senior Management Team (SMT) and ensuring necessary action items are communicated and completed.
• Developing and maintaining tracking, filing and/or record keeping systems; recommending and implementing improvements to administrative processes, introducing procedural changes seamlessly and consistently.
• Supporting the division’s culture as lead for organizing divisional and team-building events (i.e. long service recognition, annual goals and accomplishments workshop).
• Analysing policies, procedures and improvement opportunities as required in support of Senior Management Team initiatives and objectives.

Knowledge, Skills & Abilities:
• Ability to transcribe notes, prepare correspondence/reports, and research a variety of topics.
• Knowledge of business English, spelling, grammar and punctuation.
• Ability to multitask, be organized, possess a strong attention to detail, and be results-oriented in a multifaceted, fast-paced environment with changing priorities.
• Ability to work both independently and interdependently.
• Ability to deal with unexpected situations in a calm and competent manner.
• Ability to exercise sound judgment and embrace accountability for decisions.
• Ability to act with tact, diplomacy and discretion with a high degree of confidentiality.
• Ability to establish and maintain effective working relationships with internal and external contacts.
• Skilled at sustaining corporate knowledge through document control and effective communication.
• Intermediate to advanced skill level in Microsoft Outlook, Word, Excel, PowerPoint and REDMS.
• Ability to maintain and expand knowledge and skills through continuous learning.

Qualifications and Experience:

A minimum 2-year Diploma in Business Administration or a comparable level of education, supplemented by a minimum of 5 years recent and related administrative experience along with experience working in a corporate environment and/or a sound working knowledge of local government. A university degree is considered an asset. Supervisory experience is required and prior work experience within a legal department/division is considered an asset.",False,1 day ago,"Richmond, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DuEzp9X9OAOp_diFuAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,YEAR
Machine Shop Manager,Zaber Technologies,https://www.zaber.com,Ladders,https://www.theladders.com/job/machine-shop-manager-zaber-technologies-vancouver-bc_74390063?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"Zaber is looking for someone motivated by the idea of taking responsibility for our internal machine shop and increasing the contribution it can make to the strategic objectives detailed below.

As a Machine Shop Team Lead, you will be responsible for overseeing the daily operations and scheduling of the machine shop and its staff, producing high-quality precision parts and components for Zaber's motion control devices, maintaining a safe work environment, developing the skills of machine shop team members, and continually improving and documenting our processes.

Zaber designs, manufactures, and sells precision motion control devices and automation systems. Our in-house machine shop is a key pillar in our strategic plan, allowing us to develop novel manufacturing methods and provide unrivaled supply chain security for our customers. These key competitive advantages allow us to compete globally in rapidly growing markets such as biotechnology, industrial automation, and optics and photonics. With our products and service, we strive to lower the barriers to automation and provide the building blocks that allow our customers to advance their technology and research.
Machine Shop Manager Responsibilities
Manufacturing
• Oversee the setup, programming, operation and maintenance of various manual and CNC machines including multi-axis mills, lathes, band saws, grinders, and a water jet
• Support the development of new products through accelerating the prototyping cycle and collaborating with engineers to optimize product designs and manufacturing processes
• Collaborate with engineering and purchasing teams on the selection of vendors or identification of parts suitable for in house manufacture
• Assist in developing new processes and machining techniques with documented safe work procedures
• Ensure jobs for production runs, internal orders, and prototype or custom parts are prioritized and scheduled effectively
Development
• Review operations to identify potential process improvement initiatives in quality assurance, efficiency, output, and capacity
• Identify suitable tools, machines and automation opportunities to support the above
• Develop novel fixturing solutions and optimized programs for higher volume parts
Management
• Supervise Zaber staff working in the machine shop, ensuring that safe work procedures are followed for all equipment
• Coordinate and collaborate with other operations teams to improve interdepartmental processes while ensuring stakeholders' needs are met
• Provide mentorship and seek out development opportunities for shop staff
• Maintain and improve machine shop documentation and provide training on the use of machine shop equipment
Machine Shop Manager Requirements

The ideal candidate will have:
• Extensive technical skills and expertise in machining processes including: running and programming CNC machining centers, operating and maintaining a wide range of manual equipment, understanding materials, utilizing measuring tools and practices, and interpreting drawings
• Experience implementing and overseeing quality control measures and safe work procedures
• Previous leadership responsibilities in a machine shop
Machine Shop Manager Wage:
• The starting wage for the role is $38 - $58/hour depending on experience.

To learn more about our company culture and benefits, visit our careers page: https://www.zaber.com/careers.",False,,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DoS7Kt6SrxN5NnUwEAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,YEAR
Civil Engineering Project Manager,Lauren Services,https://www.laurenservices.com,Indeed,https://ca.indeed.com/viewjob?jk=f1cc66aa524187f5&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"Lauren Services provides a full suite of project delivery services to the Energy sector. We offer complete EPCM services including Project Management, Feasibility Studies, Full Service Engineering, Detailed Design, Procurement, Construction Management, Commissioning & Start-up and Operations Maintenance Support.

At Lauren, we pride ourselves in successfully executing projects that are safe, high quality, cost effective and completed on time. Our team leaders capitalize on their years of experience supported by a solution driven group of professionals. Lauren Services' business model is based on repeat business by developing long term relationships with our clients.

Position Overview:
• Manage all phases of engineering projects, ensuring they are delivered on time and within budget. Coordinate with multidisciplinary teams, including client stakeholders and construction professionals, to develop comprehensive solutions that meet project goals.
• Build and maintain strategic alliances with clients, treating them as key stakeholders in the engineering process.

Qualifications:
• Minimum of 10 years of experience working in civil and/or structural engineering projects with a proven track record.
• In-depth knowledge of civil and structural engineering principles and construction practices relevant to the energy sector.
• Strong analytical and problem-solving abilities, with a keen attention to detail.
• Effective verbal and written communication skills, capable of conveying complex technical information to diverse audiences.
• PMP certifications are an asset.
• Bachelor’s degree in Civil Engineering or Structural Engineering
• Facilitate ongoing dialogue and incorporate client input into planning and design phases to ensure project success from their perspective.
• Serve as the primary client contract and project resource for civil and structural engineering projects, providing expert guidance on overall project support, design, analysis, and construction methodologies relevant to the industry.

Responsibilities:
• We are seeking a Civil/Structural Project Manager with a strong engineering and client relationship background with hands-on experience in the industrial market sector working in ports and terminals.
• The ideal candidate will oversee client projects and programs, provide expert guidance, and ensure client and company interests and requirements are met, contributing to our mission of advancing industry partnerships.
• As the Civil/Structural Project Manager, you will be responsible for driving project and client success, cultivating client relationships, and promoting revenue growth through trusted partnerships.

This role could be either contractor or employee hourly and the range is $65-100/Hour depending on job specific experience, years of total work experience and education.",False,,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DKOZ7kQcOqBtqTowhAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,HOUR
"Engineering Manager, Backend",Motive,https://gomotive.com,Trabajo.org,https://ca.trabajo.org/job-2938-54472c00445b7c11c4c5505234f1751a?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"About the Role:

As an Engineering Manager, you will lead and mentor a team of skilled software engineers, ensuring the successful delivery of projects and fostering a culture of collaboration and innovation. This role requires strong leadership, technical expertise, and a commitment to driving excellence in software development specifically supporting our Enterprise organization.

What You'll Do:

- Team Leadership: Lead, mentor, and manage a team of software engineers, fostering a culture of collaboration, innovation, and high performance. Provide guidance on technical challenges, career development, and performance improvement.
- Project Management: Oversee the planning and execution of software engineering projects, ensuring alignment with business goals and objectives. Define project objectives, scope, and deliverables, and monitor progress to meet deadlines.
- Technical Direction: Provide technical leadership and guidance to the engineering team, ensuring adherence to best practices and coding standards. Collaborate with architects and senior engineers to define and implement technical strategies.
- Cross-Functional Collaboration: Collaborate with product managers, quality assurance, and other stakeholders to ensure effective coordination across different functions.Drive communication channels to address project-related challenges and provide solutions.
- Innovation and Continuous Improvement: Encourage a culture of innovation within the engineering team, promoting the exploration of new technologies and methodologies. Drive continuous improvement initiatives, identifying areas for optimization and enhancement.
- Resource Management: Optimize resource allocation, ensuring the efficient use of talent and expertise. Address resource constraints and bottlenecks to maintain project timelines.
- Quality Assurance: Oversee the quality assurance process to ensure the delivery of high-quality software products.Implement testing and validation processes to meet quality standards.Stakeholder Communication: Provide regular updates to key stakeholders on project status, achievements, and challenges.

What We're Looking For:

- Bachelor's degree in Computer Science, Engineering, or a related field; advanced degree is a plus.
- 8+ years of progressive experience in software engineering, with at least 2 years in a leadership role
- Proven success in leading and delivering complex backend software engineering projects.
- Strong understanding of software development processes and methodologies
- Excellent leadership, communication, and interpersonal skills.

#J-18808-Ljbffr",False,15 days ago,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DKTDC4_9JDxg6HYe0AAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,
Software Test Engineering Manager,Primesoft Solutions Inc,https://www.primesoft.net,Indeed,https://ca.indeed.com/viewjob?jk=ab8e903bebc24c08&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"• Over 8 years of software testing manager experience.
• Proficiency with product-relevant testing and process tools.
• Excellent managerial skills with the ability to lead and inspire a team.
• Experience with test automation frameworks, Software Testing and Applications Development.
• Eagerness to learn, introduce and improve new and existing test practice and process.
• Experience in automation test development in Selenium framework with TestNG, Maven, Log4j, Extent Reports, Junit, and Cucumber BDD or other automation tools.
• Medical Devices software test automation on O-arm for Surgical Imaging and maintaining FDA standards for surgical imaging systems is a plus.
• Develop VnV protocols in the Healthcare domain and developing Test Plans and Strategies.
• Lead and manage the test engineering team, providing mentorship and support to ensure the highest level of performance.
• Collaborate with across the business working with various teams to identify and resolve testing issues and optimize testing workflows.
• Provide end-to-end software testing support for time and business critical projects by leading test strategy, plan, execution, documentation, defect management and status reporting.
• Implements core project management tools, methods and best practices to assemble software testing plans that align with the project/release and with expectations of sponsors and stakeholders, and meets business needs.
• Develop and maintain software test automation frameworks, solutions, and automated test scripts using Selenium, TestComplete, TestNG, etc. with JavaScript, Java programming and with Artificial Intelligence technologies and AI powered automation tools.
• Develop and maintain end-to-end Automation Scripts, Automation frameworks, and review of Test Scripts.
• Experience in data analysis with SSIS packages and SQL servers for analysis of patient data in the healthcare domain.
• Provide training and development opportunities for team members to improve their skills and knowledg

Job Features
• Experience : 8+ Years
• Qualification : Bachelor’s degree
• Location : Vancouver, British Columbia, Canada
• Work authorization: Canada (required)
• Job Type: Full-time",False,,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DFS_WeJ8X635CoWTeAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,
Engineering Business Unit Leader,Moffatt & Nichol,https://www.moffattnichol.com,LinkedIn,https://ca.linkedin.com/jobs/view/engineering-business-unit-leader-at-moffatt-nichol-4144438565?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"Moffatt & Nichol is actively looking for our Vancouver Business Unit Leader. This leader will guide the strategic growth of the established offices in Vancouver, BC by leading efforts to identify, capture and complete projects in the ports, marine terminal, coastal, water resources/stormwater, transportation, energy, environmental, Federal, Provincial, Private, and urban development markets.

The best candidate for this role will lead the team to:
• Achieve Moffatt & Nichol (M&N) and client objectives; enhance client and employee satisfaction through effective business unit operations;
• Ensure staff management and development;
• Deploy and manage project resources, including subconsultants, vendors; and
• Provide oversight of project phases (planning, set-up, execution, and closure) while in conformance with M&N business and client contract requirements.
• Coordinate with the three M&N practices to identify additional markets and other regional office locations within the Pacific Northwest (Washington) and Alaska.
• Manage and maintain resources within the offices, and work to continue to attract top talent in the industry for growth and to maintain client service

Moffatt & Nichol is a leading U.S.-based global infrastructure advisor specialising in the planning and design of facilities that shape and serve our coastlines, harbours, and rivers. Reflecting Moffatt & Nichol’s commitment to design innovation since 1945, Engineering News-Record (ENR) has ranked the company No. 1 in Marine and Port Facilities and among the Top 50 Designers in International Markets.

Moffatt & Nichol's professional staff includes engineers, planners, scientists, and architects who serve our global client base from offices in Europe, the Americas, and the Pacific Rim. The firm provides clients worldwide with customised service and a level of excellence that have become the firm’s hallmark in three primary practise areas—coastal, environmental, and water resources; ports and harbours; and transportation, bridges, and rail.

Duties And Responsibilities

Lead the Business Unit to achieve Key Performance Indicators
• Identify, evaluate, and pursue approved business and market opportunities
• Develop and direct execution of strategy for office growth and staff resource expansion
• Develop an Annual Operating Plan and Budget for the Vancouver Business Unit, and manage the Business Unit to achieve planned results
• Manage a project portfolio and coordinate with other Business Unit Leaders (BULs) to facilitate work share and mutual achievement of financial results
• Assist in promoting company-wide services across Canada and related markets
• Work with PM’s and key staff in the preparation of comprehensive scopes of services with associated consulting fees; negotiate scope/fees with public and private sector clients
• Advise M&N on local business climate and trends, opportunities, changes in local A-E consulting practices (laws, rules, regulations, licensing, taxes), politics, and other issues pertinent to business operations
• Ensure M&N policies, procedures, and any applicable legislation and regulations are communicated, understood, and implemented within the Business Unit
• Ensure Business Unit compliance to M&N Quality Management Initiatives
• Provide a safe and secure work environment by effectively managing the facility
• Negotiate and execute corporate documents and other binding instruments
• Identify obstacles to success and participate in improvement initiatives
• Identify project pursuits and develop capture plans leading to successful project wins

Lead and ensure all projects and project managers meet Key Performance Indicators
• Review and approve project approach, plan, schedule, and budget with PMs
• Conduct client debriefs at designated project milestones; resolve elevated client concerns or demands not addressed by the PM
• Mentor, guide, advise, and ensure PMs accountability for project performance and deliverables, assist with assignment requests and approve project team assignments
• Participate in significant Project Reviews, review Project Progress Reports, and direct appropriate change
• Ensure that Quality Control is implemented and managed in accordance with the contract and Project Plan
• Approve Subcontracting Plan and verify that candidate subconsultants will likely result in achievement of subcontracting goals
• Approve selection of subconsultants
• Coordinate with Business Development and other M&N groups to manage client relationships and satisfaction
• Ensure that pursuit opportunities align with objectives of the firm, approve the budget, and the Proposal Number Request

Lead, develop, and oversee staff, including hiring, performance management, and succession planning
• Effectively lead and motivate Business Unit employees for a positive impact on retention, and an engaged, motivated, and sustainable workforce
• Ensure that succession plans are established and implemented as required for transfer of industry relationships and technical skillsets
• Identify staffing and hiring needs for the Business Unit; organize hiring teams, confirm/approve hiring decisions
• Conduct staff performance reviews and provide annual merit and bonus recommendations
• Initiate and approve off-cycle merit and bonus recommendations as needed
• Lead staff performance management and performance improvement for the Business Unit; approve and implement termination decisions

Other Duties

Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.

Qualifications
• Bachelor’s degree in an engineering or related civil/environmental infrastructure field; required
• 20+ years’ experience in the consultancy addressing planning engineering design, infrastructure development, project management, client service, and business development; required
• Professional Engineer registration (P.Eng) in Vancouver or ability to receive through reciprocity within 6 months; required
• Demonstrated leadership experience overseeing projects, staff, and client relationships; required
• A solid reputation with private sector clients as well as local and state government agencies, and a knowledge of coastal, water resources/stormwater, ports, marine terminal, transportation, energy, environmental, federal, or urban development markets throughout Vancouver; required
• Proven success directing design and construction of a wide range of civil engineering infrastructure projects
• Proven success in leading people and managing resources
• In depth understanding of Vancouver’s infrastructure and resiliency markets as it relates to M&N’s three Practice Areas: Water, Ports, and Transportation
• All new hires will be required to successfully complete and pass a pre-employment (post offer) background check in compliance with NIST 800-171

Preferred Education And Experience
• Master’s degree in Civil, Coastal, Water Resources/Stormwater or Structural Engineering or Economics, Planning

Supervisory Responsibilities
• Leads, develops, and oversees a wide variety of technical staff including engineers, economists, planners, scientists, administrative, and technicians

Working Conditions

Majority of work is office based. Sedentary for prolonged periods of time, interact with clients, and travel occasionally.

Moffatt & Nichol’s EEO Statement

As a global business, Moffatt & Nichol relies on diversity of culture and thought to deliver on our goal of Creative People, Practical Solutions® serving our client needs, and ensures nondiscrimination in all activities in accordance with the Canadian Charter of Rights and Freedoms which is enshrined in the Canadian Constitution (CA) or omit if other international location . We draw from the world’s best and brightest, regardless of geographic, cultural, or institutional background. This approach enables us to better understand and serve our clients, foster innovation, and create a rich, collaborative work environment. Moffatt & Nichol is proud to be an Equal Employment Opportunity / Federal Contractor desiring priority referrals of all protected veterans for job openings.

If you need more information or require special assistance for persons with disabilities or limited English proficiency, please contact Human Resources at (562) 590-6500 or TTY/TDD users please call 711.",False,,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DIGVBGvrQNwZ_xmmXAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,
"Mobile Engineering Manager, Onboarding","Block, Inc.",https://block.xyz,Indeed,https://ca.indeed.com/viewjob?jk=f2b80dbedf997016&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"Since we opened our doors in 2009, the world of commerce has evolved immensely, and so has Square. After enabling anyone to take payments and never miss a sale, we saw sellers stymied by disparate, outmoded products and tools that wouldn't work together.

So we expanded into software and started building integrated, omnichannel solutions – to help sellers sell online, manage inventory, offer buy now, pay later functionality, book appointments, engage loyal buyers, and hire and pay staff. Across it all, we've embedded financial services tools at the point of sale, so merchants can access a business loan and manage their cash flow in one place. Afterpay furthers our goal to provide omnichannel tools that unlock meaningful value and growth, enabling sellers to capture the next generation shopper, increase order sizes, and compete at a larger scale.

Today, we are a partner to sellers of all sizes – large, enterprise-scale businesses with complex operations, sellers just starting, as well as merchants who began selling with Square and have grown larger over time. As our sellers grow, so do our solutions. There is a massive opportunity in front of us. We're building a significant, meaningful, and lasting business, and we are helping sellers worldwide do the same.

The Role

The Onboarding team is responsible for the experiences within our mobile apps that help establish our Sellers' identity with the product we provide and support them as issues arise. This spans features across authentication (sign-in and multi-factor), onboarding (Know Your Customer), account security, support, and help live messaging across the Square ecosystem of products.

You will
• Manage a team of 9 mobile engineers (iOS and Android)
• Represent the team in architectural discussions and serves as a bridge between our team and the broader organization
• Work with product managers, designers, and data scientists to shape the future of onboarding-related product areas at Square
• Define and prioritize the technical roadmap for the team
• Shape the future of our codebase by building flexible, extendable, and reusable components
• Provide technical guidance and uphold technical standards for systems and applications
• Foster a culture of engineering excellence and mentor engineers of all experience levels
• Contribute to a culture of positivity, psychological safety, and inclusivity within the team.

You have
• 3+ years of people management experience leading a team of mobile engineers (both iOS and Android)
• Prior experience in mobile application development with a focus in Android
• Experience working with multiple stakeholders, driving alignment, and championing performance

Technologies we use and teach
• Kotlin/Swift, leveraging Square's modern open source library, Workflow
• Espresso, Snapshot, Gradle
• Protocol buffers for network transport
• Also exposure to LeakCanary, RXJava, Dagger, Mortar, and Okhttp among others

We're working to build a more inclusive economy where our customers have equal access to opportunity, and we strive to live by these same values in building our workplace. Block is an equal opportunity employer evaluating all employees and job applicants without regard to identity or any legally protected class. We also consider qualified applicants with criminal histories for employment on our team, and always assess candidates on an individualized basis. We believe in being fair, and are committed to an inclusive interview experience, including providing reasonable accommodations throughout the recruitment process. If you require an accommodation, let your recruiter know.

Block takes a market-based approach to pay, and pay may vary depending on your location. Canada locations are categorized into one of two zones based on a cost of labor index for that geographic area. The successful candidate’s starting pay will be determined based on job-related skills, experience, qualifications, work location, and market conditions. These ranges may be modified in the future.

Zone A:

$184,200—$276,400 CAD

Zone B:

$184,200—$276,400 CAD

Every benefit we offer is designed with one goal: empowering you to do the best work of your career while building the life you want. Remote work, medical insurance, flexible time off, retirement savings plans, and modern family planning are just some of our offering.

Block, Inc. (NYSE: XYZ) builds technology to increase access to the global economy. Each of our brands unlocks different aspects of the economy for more people. Square makes commerce and financial services accessible to sellers. Cash App is the easy way to spend, send, and store money. Afterpay is transforming the way customers manage their spending over time. TIDAL is a music platform that empowers artists to thrive as entrepreneurs. Bitkey is a simple self-custody wallet built for bitcoin. Proto is a suite of bitcoin mining products and services. Together, we’re helping build a financial system that is open to everyone.",False,17 days ago,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3D4bhxWz8IUrDLzAAgAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,YEAR
Integrations and Development Team Leader,Norton Rose Fulbright,https://www.nortonrosefulbright.com,LinkedIn,https://ca.linkedin.com/jobs/view/integrations-and-development-team-leader-at-norton-rose-fulbright-4183178946?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"Hybrid schedule - 3 days in office - can be fill in any of our offices

The Team Lead, Integrations & Development will have ownership of the Canadian regional application integration and development portfolio. They will plan, organize and follow up on activities and improvements to the application portfolio and leverage their team of direct reports to do so. They will be accountable for continuously delivering new solutions to drive business value, while also focusing on business-as-usual activities.

You Will Be Focusing On
• Defines and implements best practices for application development and system integrations (including coding standards, design patterns, and testing methodologies).
• Drives technical decision-making, ensuring that the team is using the most appropriate technologies and approaches.
• Stays abreast of the latest technologies and trends and identify opportunities to improve our development processes.
• Collaborates with cross-functional teams to ensure successful project and initiative delivery.
• Participates in the planning and estimation of development projects.
• Breaks down complex projects into smaller, manageable tasks and assign them to team members.
• Monitors project progress, identify and resolve roadblocks, and ensure projects are delivered on time and within budget.
• Hands-on development of key features and components of applications and integrations.
• Ensures the quality and performance of applications through rigorous testing and code reviews.
• Continuously identifies and implements improvements to our development and integration processes.
• Introduces new technologies and methodologies to improve team efficiency and productivity.
• Acts as a technical resource for all technological matters, whether support or change related, within their assigned technologies.
• Performs business and functional analysis in relation to assigned processes/platforms
• Leads a team of direct reports.
• Supports knowledge transition.
• Provides afterhours call support.

What You Bring To The Role
• A Bachelors’ Degree with a technology focus, such as Computer Science, or equivalent combination of experience, education, and professional certifications.
• At least 10 years of experience in IT progressing from a developer/integrator/DBA.
• At least 1-2 years of experience in direct line resource management.
• Proven expertise in software development, .NET, SQL, and other integration technologies required.
• Achieved ITIL Foundation certification.
• Experienced in the management of a geographically distributed team of highly technically skilled employees.
• Highly effective at translating complex technical concepts to non-technical business stakeholders.
• Possesses strong business planning, analytical, and conceptual skills.
• Knowledge of legal industry technologies including document management, practice management, knowledge management and case management systems highly desirable.
• Willingness and flexibility to work non-standard hours as required to support project and support activities.
• Deals effectively with conflict and remains calm under pressure.

Vancouver Salary: $87,665 - $142,454. Salary will be discussed and negotiated during interview and will be based on experience.

Why Join Our Team
• Hybrid work environment
• Retirement savings plan with employer contribution
• Benefit premiums paid by the firm
• Telemedicine services
• Wellness matters: Flexible health and wellness allowance that covers much more than gym memberships!
• Training and development programs based on your interests and needs

Ready to join a proactive and modern firm that provides an exceptional career experience in an inclusive and collaborative environment? Come join us!

As part of a global legal practice, Norton Rose Fulbright Canada embrace a culture of excellence and client service, but always with a focus on flexibility, respect, diversity and openness. We strive to create an equitable, inclusive environment where everyone can bring their whole self to work and realize their career potential.

To find out more about how we integrate diversity, equity and inclusion in everything we do please click Diversity, equity and inclusion | Canada | Global law firm | Norton Rose Fulbright.

If you require any reasonable adjustments during the recruiting process, please inform us in the recruitment application. We will contact you to further discuss your need.

Please note that applicants who receive an employment offer may be required during their employment with Norton Rose Fulbright to provide proof of vaccinations recommended from time to time by government or public health authorities. Norton Rose Fulbright has a duty to accommodate those who are unable to get vaccinated due to protected grounds. For applicants who require an accommodation, please contact us to discuss further.

Law around the world

nortonrosefulbright.com",False,3 days ago,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DlBUAE8aJ4OTizYNJAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,
"Assistant Manager, Engineering",British Columbia Rapid Transit Company,,LinkedIn,https://ca.linkedin.com/jobs/view/assistant-manager-engineering-at-british-columbia-rapid-transit-company-4155470438?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"Marketing Statement

Join a company that has been a part of moving Metro Vancouver for over 35 years.

British Columbia Rapid Transit Company Ltd. (BCRTC) maintains and operates the Expo and Millennium SkyTrain Lines from our central facilities in south Burnaby. Our services connect downtown Vancouver to the cities of Burnaby, New Westminster, Coquitlam, Port Moody and Surrey. With the future expansion of both the Expo and Millennium Lines gathering pace, infrastructure renewal and new asset acquisition projects underway, this is an exciting time to join our team of over 1,200 dedicated employees, working on one of the longest fully-automated rapid transit systems in the world.

Our work encompasses roles such as administration, engineering, elevator and escalator maintenance, field operations, vehicle maintenance, and wayside (station and guideway) maintenance.

When you work for SkyTrain, not only will you help move Metro Vancouver, you will also have access to comprehensive benefits including paid vacation, medical benefits, transit passes, training and more. We are a proud equal opportunity employer, committed to a diverse and inclusive workforce.

Come explore what makes us one of BC’s Top Employers!

Responsibilities

PRIMARY PURPOSE

Supports the Senior Manager in overseeing the maintenance, operations, and safety of assets within the transit system. Assists in managing day-to-day activities related to maintenance, operations, budget management, safety compliance, stakeholder liaison, and project coordination. By collaborating with various stakeholder, this role will help to ensure smooth and efficient operations of the system, contributing to the overall reliability and safety of the transit service provided by BCRTC. Where required, the Assistant Manager may assist Senior Management in the division’s strategic and operational planning.

Key Accountabilities

Actively participates as a member of the management team at BCRTC, providing specialized input into the development of divisional goals, objectives, strategies, costing, business case development, policies, procedures, planning, and quality assurance. Shares accountability for departmental achievements.

Supports the development and adherence to annual departmental budgets within the team. Assists in formulating and delivering operational metrics and key performance indicators necessary for measuring business performance. Recommends strategies to address performance gaps.

Takes accountability for the successful execution of annual training plans, in compliance with corporate and regulatory standards.

Manages the annual shift schedules to optimize staff utilization. Ensures the department meets all staffing, cost recovery, and overtime constraint goals.

Represents the Team at coordination meetings, offering input into initiatives aimed at improving procedures and practices. Represents departmental needs in various capital and systems upgrade projects at the working group level. Ensures that upgrade plans align with the Maintenance requirements and are manageable.

Reviews all service delays and follows up on mitigation plans and corrective actions for all delays. Raises any areas of concern to the Senior Manager and provides recommendations to reduce operational delays.

Takes responsibility for Emergency Planning and Incident Management. Plans exercises to rehearse emergency procedures in collaboration with Safety and assists in conducting Operational Debriefs following incidents.

Assists in safety and performance investigations, root cause analysis, and corrective actions identification.

Manages reporting staff including selection, development, coaching, performance management and all other people management practices.

Qualifications

EDUCATION AND EXPERIENCE

The requirements for this job are acquired through completion of a Degree in Engineering, Computer Science or relevant disciplines and 6 years of related experience in progressively responsible positions.

Other Requirements

Advanced leadership, and team building skills to manage direct reports, and to provide guidance to indirect reports including solid knowledge of labour relations, dispute resolution, and related legislation in the context of people management.

Solid knowledge of safety and workplace compliance regulations and legislations.

Excellent communication skills, both written and oral, including ability to effectively communicate technical information in a clear and concise manner.

Solid analytical and problem-solving skills.

Excellent organizational and time management skills, including the ability to prioritize tasks while balancing competing demands.

Effective change management and critical thinking skills

Solid computer skills in standard office tools including word processing and spreadsheet software and use of web-based systems.

Due to the nature of the 24/7 services, BCRTC provides, there may be times when late or extra hours are required.

Other Information

Recruitment Process: An applicant will be required to demonstrate their suitability for this position by meeting the minimum level of qualifications and experience in order to be invited into the selection process. A standard interview format will be used including general, scenario and behavioural descriptive interview questions.

Work Schedule

37.5 hours per week.

Work Designation

Resident

This position works predominately on-site

Rate of Pay

Salary $97,600 - $146,400 per annum (Actual salary offered will be commensurate with education, experience and internal parity).

The Total Compensation Package includes Extended Health, Dental, Transit Pass and enrollment in the Public Service Pension Plan. Focus on your development through tuition reimbursement, training, and mentorship programs. Enjoy a variety of health and wellness programs, including access to gym facilities. Speak to us to know more about what we offer.

How To Apply

Please click the 'Apply' button at the top right corner or go to http://www.translink.ca/careers to apply for this position and view instructions on the process.

INSTRUCTIONS: Please save your (1) cover letter, and your (2) resume as one pdf document prior to uploading your application on-line.

Posting Date: February 19, 2025

Closing Date: Open until filled

Please note that only those short listed will be contacted.

Having trouble applying? Please view the System Requirements & FAQ's by going to http://www.translink.ca/careers.

Equal Employment Opportunity

SkyTrain is committed to employment equity and building a diverse workforce, representative of the customers we serve and the many communities in the Metro Vancouver region. We welcome and encourage Indigenous applicants, people of colour, all genders, 2SLGBTQ+ and persons with disabilities to apply. Learn more about TransLink's commitment to to equity, diversity and inclusion.

Accommodations are available on request for candidates taking part in all aspects of the selection process. For a confidential inquiry, simply email us at jobs@translink.ca.",False,2 days ago,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Dv3SHnzu2G9GE3bKWAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,
"Software Development Manager, Digital Acceleration",Amazon Development Centre Canada ULC,,Indeed,https://ca.indeed.com/viewjob?jk=b5027fb284911595&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"- 3+ years of engineering team management experience - 7+ years of working directly within engineering teams experience - 3+ years of designing or architecting (design patterns, reliability and scaling) of new and existing systems experience - 8+ years of leading the definition and development of multi tier web services experience - Knowledge of engineering practices and patterns for the full software/hardware/networks development life cycle, including coding standards, code reviews, source control management, build processes, testing, certification, and livesite operations - Experience partnering with product or program management teams
Want to define the next-generation subscriptions engine powering purchasing of digital content and subscriptions? Excited about building highly scalable and flexible transactional systems responsible for managing billions of orders and subscriptions? Ready to rise to the challenge to enable an ever-growing set of businesses across the company to customize their purchase experiences? If you are a passionate, self-motivated, excellent people manager and an effective delivery manager who loves solving deep technical problems then we are looking for a leader like you! The Subscriptions team in Digital Acceleration is recruiting for a Software Development Manager to lead a key part of our development team focused on building a subscriptions engine to enable businesses across the company to sell digital goods and provide subscriptions. Some of our noteworthy businesses are Prime, Kindle Unlimited, Audible, Applications, Music, Books, Newspapers, and Videos. We are currently developing the next-generation subscriptions engine to bring new features to our partner businesses, reduce latency and simplify onboarding. Come join us to shape the future of digital purchasing and subscriptions! Key job responsibilities As a Software Development Manager, you will lead a team focused on building a subscriptions engine to solve problems that make it easier to buy subscriptions and digital goods across Amazon and external partners. The team would enable businesses to adopt new sales channels and make those channels seamless and fully-featured for customers. You will be responsible for leading a team of engineers in design, development, test, and deployment of these services, at the same uphold the bar for OE (operational excellence). You will also be responsible for growing your team via hiring and developing engineers to meet their career goals. Candidates will need to think outside the box to quickly come up with innovative solutions to problems that are unique to Amazon. A successful candidate will have an established background in developing real time scalable systems, a strong technical ability, excellent project management skills, great communication skills, and a motivation to achieve results in a fast paced environment. About the team Amazon Digital Acceleration powers ordering, subscriptions, and device management for Prime, Amazon Video, Music, Audible, Alexa, and Kindle, amongst other digital businesses. We process billions of digital purchases every year and enable our digital businesses to grow their businesses worldwide. We are on a mission to be earth's best provider of one-time and recurring digital commerce, delivering a seamless and enjoyable post-purchase customer experience.
• Experience in communicating with users, other technical teams, and senior leadership to collect requirements, describe software product features, technical designs, and product strategy
• Experience in recruiting, hiring, mentoring/coaching and managing teams of Software Engineers to improve their skills, and make them more effective, product software engineers

Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, disability, age, or other legally protected status.

Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.

The base salary for this position ranges from $171,400/year up to $286,200/year. Salary is based on a number of factors and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. Applicants should apply via our internal or external career site.",False,5 days ago,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DeeAaQPk_g-YWnQ6dAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,YEAR
"Mechanical Project Manager, Buildings | Engineering Firm | Vancouver – Outpost Recruitment",confidential,,Outpost Recruitment,https://outpostrecruitment.com/job/mechanical-project-manager-engineering-building-services/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"Mechanical engineering firm is seeking Mechanical Project Manager to join their growing operations with experience across market sectors including large commercial, residential and institutional projects ranging $50m - $250m in Vancouver BC. This position provides the opportunity to work with a truly innovative and passionate team. Salary range is $90,000 - $120,000. Outpost Recruitment is excited to work with our client on this full-time permanent role.
Responsibilities of Mechanical Project Manager:
• Perform engineering load calculations, equipment sizing and selection for HVAC, hydronics and plumbing systems
• Mechanical Project Manager will play a key role in our design division. Responsible for the execution of projects from design through to construction
• Ensure all standards and codes are implemented and you will be responsible for meeting and exceeding client expectations while continuously improving the project bottom line
• The role requires design experience and capabilities to work alongside the existing Vancouver team
• Building sustainable relationships with clients through successful project delivery will be critical for representing the brand, drive successful project outcomes, reduce risks, ensure adherence to policy & codes
• Create and maintain project resources for the design team
• Support the recruitment, onboarding, mentoring and training of junior design staff
• Manage projects to achieve client satisfaction and profitability targets
• Be responsible for the complete design and project management of smaller projects under the guidance of the Mechanical Design Manager
• Prepare written reports as required including schematic design/ design development reports and feasibility studies
• Prepare book specifications and other tender documentation
• Liaise with equipment suppliers, vendors and manufacturers
• Coordinate with other consultants
• Attend contractor walkthroughs during the tender period as required by the client
• Be responsible for contract administration including issuance of site instructions, review of shop drawings, attendance at regularly scheduled site inspections and production of field review reports
• Assist the management team in areas of business development, sales and marketing, team personnel, technical design and related activities
• Attend design/ construction meetings during a project
• Act as the principle liaison with selected clients or major projects
• Prepare workloads and aid in scheduling tasks and allocating team resources
• Ensure quality control and quality assurance by following company QA/ QC guidelines and procedures
• Stay up to date with current building code and technologies and arrange training where necessary
• Coordinate with the energy modeling department in liaising with the design team
• Promote the company brand and seek out new work, clients and relationships at every opportunity

Requirements of Mechanical Project Manager:
• Mechanical Project Manager will have minimum 5+ years of experience in the fields of HVAC, hydronics, refrigeration and plumbing
• Solid analytical skills and attention to detail
• Proven ability to read and interpret blueprints, plans, and manuals
• Working knowledge of the design of mechanical building systems and drawing preparation for commercial, mixed-use and residential developments
• Technically relevant college certificate or university degree
• Excellent English written and verbal communication skills
• Proficiency using MSOffice suite applications (Word, Excel, PowerPoint, etc.)
• Proficiency using AutoCAD software
• REVIT 3D experience desirable
• Familiarity with HVAC load calculations for buildings

Compensation:
• Salary range: $90k-120k
• Employer Covered Health and Dental benefits
• Training and professional development support

Ideal Candidate:

Only candidates with authorisation to work in Canada will be considered

Please clearly highlight relevant work experience, project overviews and project scale ($) in your resume.",False,10 days ago,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3Dao27k91XOr9TT0AbAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,YEAR
Senior Mechanical Engineer,Sacré-Davey,https://www.sacre-davey.com,LinkedIn,https://ca.linkedin.com/jobs/view/senior-mechanical-engineer-at-sacr%C3%A9-davey-4183875927?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"Senior Mechanical Engineer
• Location: Remote
• Employment Type Full Time
• Reports to: Manager, Mechanical Engineering

Company Overview

At Sacré-Davey, we are a privately held, multi-disciplinary engineering and project management firm serving the mining, energy, and industrial sectors. With offices across Canada, the United States, and the Philippines, we provide global expertise to help our clients de-risk and maximize their project value.

Our projects span mineral processing plants, renewable fuels, hydrogen production facilities, and more. Sustainability and innovation are at the heart of what we do, driving our mission to create a better future for all.

Join our team to make a meaningful impact in building sustainable solutions.

Role Overview

We are seeking a talented Senior Mechanical Engineer to join our innovative team. In this role, you will lead the design, development, and optimization of complex mechanical systems and products, ensuring they meet rigorous performance, quality, and safety standards. As a senior team member, you will mentor junior engineers, manage high-impact projects, and contribute to strategic initiatives that drive the success of the organization.

Key Responsibilities
• Leadership
• Serve as the Engineer of Record and discipline lead on designated projects.
• Lead the execution of projects and managing discipline project spend, deliverable quality and management of change.
• Track and report on the progress of projects to project management.
• Technical Experience
• Full cycle EPC experience
• Experience with pipe stress analysis such as Caesar II
• Experienced in the creation and checking of material specifications for piping systems
• Experienced with design and specification of pressure equipment such as tanks, pressure vessels, heat exchangers
• Ensure all deliverables comply with industry standards and regulatory requirements.
• Able to travel to job sites as required.
• Communication
• Effectively communicate within project teams and with clients in a remote working environment.
• Collaborate with cross-functional teams, basic cross-functional knowledge.
• Prepare and present detailed reports, documentation, and presentations for internal and external stakeholders
• Mentorship
• Mentor junior engineers, fostering a culture of continuous improvement and technical excellence at all levels.
• Build strong relationships with vendors, suppliers, and external partners

The Ideal Candidate Will:
• Exhibit exceptional leadership skills, technical expertise, and a passion for innovation.
• Demonstrate a strong commitment to quality, sustainability, and client-focused solutions.
• Thrive in dynamic, team-oriented environments that encourage creativity and collaboration.

Skills & Qualifications
• Education: Bachelor’s degree in Mechanical Engineering or a related field.
• Experience: 10+ years of experience in mechanical engineering with demonstrated success in managing complex projects.
• Certifications: Professional Engineer (P.Eng) license required (registered in the provinces of British Columbia and Alberta preferred).
• Soft Skills: Excellent problem-solving, communication, and organizational skills.

Why Join Sacré-Davey?
• Competitive Compensation: Fair pay reflective of your skills and contributions.
• Work-Life Balance: Flexible work arrangements to support your well-being.
• Growth Opportunities: Continuous development through training and mentorship.
• Inclusive Culture: A supportive workplace that values diversity and innovation.

How to Apply

If You’re Passionate About driving innovation and delivering cutting-edge mechanical solutions, we’d love to hear from you!!

To Apply:
• Submit your resume directly to this job posting.
• Alternatively, join our talent pool by creating a profile on the ADP platform to stay connected for future opportunities.

Equal Opportunity Employer:
Sacré-Davey is committed to fostering an inclusive workplace. We welcome applicants from all backgrounds and provide accommodation for those with specific needs in accordance with applicable legislation.

Compensation details: 92800-114900 Yearly Salary",False,2 days ago,"North Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DdsXIHglvSvfhZqriAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,
"Project Manager I, Engineering Services",Seaspan ULC,https://www.seaspan.com,Indeed,https://ca.indeed.com/viewjob?jk=a33414539fe23419&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"The Project Manager is responsible for leading and delivering ship construction and engineering projects from concept through to completion, ensuring alignment with cost, schedule and quality requirements. This role involves managing multi-disciplinary teams, coordinating with stakeholders, mitigating risks, and optimizing project execution. The Project Manager will provide leadership in planning, execution and delivery of technical solutions across ship construction/shipbuilding, vessel maintenance and refit projects.

Note: Due to business needs, this position is required to be fully on-site based at 2 Pemberton Avenue, North Vancouver.

What you’ll do
• Lead project management efforts for ship construction and engineering projects, including new construction, vessel maintenance and refits.
• Develop and manage project plans, including construction scope, schedule, resource allocation and budgets.
• Oversee the execution of engineering deliverables, ensuring compliance with project requirements, cost, schedule and quality standards.
• Prepare and submit proposal packages, including technical scope of work, cost estimates, and schedules.
• Manage subcontractors and vendors, ensuring alignment with project objectives and contractual obligations.
• Facilitate stakeholder meetings, progress reviews, and project reporting to ensure transparency and alignment.
• Collaborate with engineering teams to assess risks, identify opportunities for improvement, and implement best practices.
• Ensure regulatory and classification society compliance across all project phases.
• Support continuous process improvements and lessons learned initiatives.
• Provide project oversight for National Shipbuilding Strategy (NSS) programs, innovation initiatives, in-service support (ISS), and program services.
• Serve as a qualified resource under the CCG Engineering Support Services (ESS) contract.
• Work with the Vessel Maintenance Manager on planned maintenance, refits, and drydocking schedules.

What you’ll bring
• Technical education in electrical engineering or related field required.
• Minimum of 4 years demonstrated experience in project management within shipbuilding, vessel maintenance, or maritime engineering domains.
• Strong understanding of project management methodologies, Earned Value Management, engineering best practices, and risk management principles.
• Experience managing subcontractors, budgets, schedules, and resource planning.
• Experience working with Navy projects and other government agencies projects.
• Excellent stakeholder engagement and communication skills.
• High proficiency in CADMATIC eShare, Jira, and ARAS is required.
• Eligible to obtain ITAR security clearance for Canadian Navy in-service support tasks.
• Established relationships with CCG, BCF, and other shipyards are highly desirable.
• Demonstrated experience handling sophisticated projects, bids or proposals. Solid ability to meet or exceed commitments in a fast paced, diverse environment with rapid change and competing priorities.
• Certified project management qualification a distinct advantage (e.g. PMP) or working towards one.
• Detailed understanding of project management techniques and methods.
• Good judgment and prioritization abilities.
• Effective, efficient communication skills.
• A strong business sense.
• Strong problem-solving skills.
• Ability to strategize and see the bigger picture, whilst focusing on the details.
• Excellent interpersonal skills, able to empower and empathize with team members.
• Ability to influence others and manage expectations.
• Familiarity with Government contracting and performance management of major subcontractors.
• Effectively manages conflict.
• Excellent computer skills including Word/Excel/PowerPoint.
• Experience working with National Shipbuilding Strategy (NSS) programs and naval vessels or similar government contracts.
• Knowledge of vessel maintenance and lifecycle management.
• Familiarity with Engineering Support Services (ESS) contracts and maritime regulations.

Why you’ll love working here
• This is a full-time, permanent position. With multiple operations and long-term projects, Seaspan employees enjoy job stability as we look ahead to build ships for decades to come.
• In addition to an annual bonus and pension plan matching, this role provides you with a very competitive salary in line with the successful candidate’s experience.
• We also provide the best-in-class health and wellness benefits package for this position, including things such as extended health care (i.e. paramedical services for massage therapy, speech therapy, mental health coverage, physiotherapy, and more), dental care, vision care, life insurance, medical leave coverage, parental leave coverage, childcare benefit partnership, $500 personal spending account, and an Employee Family Assistance Program (EFAP).

The estimated salary for this position is $106,900-$128,300. In determining final salary, Seaspan considers many factors including the successful Candidate’s skillset and experience as well as position location and internal equity. The final base salary offer will be at the Company’s sole discretion and presented as part of a competitive total compensation package.

Language Requirement: English

NOC: 70010

For more information, please contact recruit@seaspan.com

#LI-LO1 #LI-ONSITE",False,19 days ago,"North Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DD9U4jpEmaahRIsBiAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,YEAR
Technical Services Manager,Heidelberg Materials North America,https://www.heidelbergmaterials.us,LinkedIn,https://ca.linkedin.com/jobs/view/technical-services-manager-at-heidelberg-materials-north-america-4141434408?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"About Us

Heidelberg Materials is one of the world's largest suppliers of building materials. Heidelberg Materials North America operates over 450 locations across the U.S. and Canada with approximately 9,000 employees.

What You'll Be Doing
• Provide technical direction and leadership for quality control employees in Aggregates and HMA.
• Offer expert technical support for customer and contractor issues in the field.
• Collaborate with operations and sales to optimize processes, develop new products, and maintain customer relationships.
• Work with consultants and engineers on specifications and innovations for aggregates, HMA and recycling.
• Develop and analyze mix designs, specifications, and quality standards to solve plant and customer problems and support product development.

What Are We Looking For
• Background in Civil or Materials Engineering or P.Eng preferred
• Extensive experience in Aggregates/RMC/HMA industry.
• Proven supervisory and management experience.
• Strong leadership, problem-solving, and analytical skills.
• Effective communication and technical proficiency in building materials.

Work Environment
• Fast-paced and dynamic work environment.
• Collaborative and supportive team culture.
• Opportunities for professional growth and development.

What We Offer
• Competitive base salary and participation in our annual incentive plan.
• Industry leading benefits package, including health, dental, and wellness.
• Pension plan with an automatic company contribution as well as matching contributions and RRSP options.
• Opportunities for training, development, career growth within a global organization.

Heidelberg Materials welcomes and encourages applications from people with disabilities. Accommodations may be available upon request for candidates taking part in all aspects of the selection process.

Req ID JR10004460

Minimum Pay Rate: 120,360.00

Maximum Pay Rate: 160,480.00",False,,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DwEz9OvmsSlb2BAQIAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,
Commissioning Manager,BBA Consultants,,LinkedIn,https://ca.linkedin.com/jobs/view/commissioning-manager-at-bba-consultants-4150503716?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"Type of position: Regular

Your future role on our team

Join BBA and make the most of your experience by actively contributing to the various stages of major engineering projects, from the earliest stages of the business relationship to onsite equipment commissioning. You’ll be using your leadership skills every day, whether it’s to develop trusting relationships with our partners, train the next generation or manage a passionate team on projects. This role will give you the opportunity to take the lead, while also being in the thick of the action by working closely with talented people. You’ll be responsible for preparing and executing safe and efficient commissioning activities and plant operations.

With us, you’ll get the opportunity to...
• Determine organizational and work force requirements (expatriates, local and subcontracted personnel) to meet facility objectives
• Develop the commissioning and startup plan documentation
• Develop the commissioning and start-up schedule, as per project completion schedules, working closely with the project team
• Direct the pre-commissioning, commissioning and startup activities at the work site
• Direct the BBA team, client personnel and subcontractor assigned to the project commissioning team
• Identify supplier support needs for process equipment commissioning
• Review test procedures from suppliers and ensure proper completion
• Coordinate with Project Management, Engineering, Construction, Quality, Safety and the Owner’s designated representatives, as required
• Implement procedures to deliver overall facility safety and that of its personnel
• Assist the engineering and expert teams with troubleshooting
• Help the client identify operational readiness tasks and documentation for plant operation
• Provide feedback and optimization recommendations to the engineering team and client

Overview Of Certifications And Job Requirements
• Bachelor’s degree in engineering and member in good standing with the OIQ
• Knowledge of process systems
• A strong commissioning or construction background
• Demonstrated leadership skills, which include the ability to lead, direct, motivate and supervise team members
• Effective soft, organizational, communication and client service skills
• Ability to think strategically, troubleshoot and multi-task
• Ability to prioritize multiple tasks and work independently with minimal supervision
• Excellent communication and leadership skills
• Willingness to work in remote locations

Do your qualities and values match our corporate culture?
• Entrepreneurial spirit
• Results-driven
• Desire to motivate and develop the next generation
• Strong commitment to health and safety
• Thirst to learn and excel
• Inspirational leadership

An Overview Of BBA’s Total Awards
• Annual base salary between – $122,000 to $190,000
• Annual premium program for regular employees
• Access to a time bank
• Onsite mobility premium
• Cellphone Program
• Group insurance plan starting day one including short-term and long-term disability insurance for regular employees
• Retirement saving plan for regular employees
• Vacation and sick leave
• Premium offered through the Employee Referral program

BBA considers many factors to determine the annual base salary such as, but no limited to: Market, education, relevant and demonstrated work experience, technical assessment, qualifications, certifications, and other relevant competencies.

At BBA, You Get Many Benefits
• Opportunity to mentor our next generation: We invest in our people and help them develop
• A corporate culture that values expertise
• Participation in innovation projects
• Promotion of our experts (SMEs), both externally and internally

About BBA

For over 40 years, we’ve been pushing the boundaries of engineering to serve our clients in the Energy and Natural Resources sector. At BBA, we develop innovative, flexible and sustainable solutions, from strategy to execution. BBA is one of Canada’s leading private consulting engineering firms, focused on practice (PCB), with a network of 18 offices. Our teams work closely to deliver projects that shape tomorrow’s industry at the local, national and international levels.

Our goal is to ensure a diverse and inclusive work environment. We do everything we can to build a workplace where all of our employees want to excel and where they feel respected, heard and valued. Every day.

Our people’s passion and excellence make BBA one of Canada’s Best Managed Companies .

We have unique talents, and we’re committed to providing a workplace where you can be yourself . Job postings are written in gender-neutral language.

Learn more about us by visiting our LinkedIn page and join the networks of our talent attraction specialists to speak with them directly.",False,9 days ago,"Vancouver, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DHW40SvpqTDzqsfOmAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,
Senior Engineering Project Manager/ Project Engineer,KTC Industrial Engineering Ltd.,,LinkedIn,https://ca.linkedin.com/jobs/view/senior-engineering-project-manager-project-engineer-at-ktc-industrial-engineering-ltd-4180068461?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic,"Do you thrive in a fast-paced environment and enjoy exceeding client expectations in the industry? If so, then this Project Manager role at KTC might be perfect for you!

About the Role:

As a Senior Project Manager specializing in Industrial Project - Preferably in Industrial Engineering ( Wood, Mining or Oil & Gas Experience) , you'll be a key player in our Project Delivery Team. You'll lead and oversee all aspects of client projects, ensuring their successful completion on time, within budget, and to the highest quality standards.

Key Responsibilities:
• Manage client relationships, acting as the primary point of contact and ensuring clear communication throughout the project lifecycle.
• Proactively identify and manage project risks, keeping stakeholders informed.
• Develop and execute project plans, adhering to schedules and budgets.
• Provide technical expertise and guidance to the project team.
• Oversee project finances, including invoicing, cost control, and ensuring accurate timesheet tracking.
• Lead and mentor Project Engineers, guiding their professional development and ensuring the quality of their deliverables.
• Review and approve all project deliverables for quality and adherence to company standards and regulations.
• Additional Skills Required:
• Proficiency in project management software (e.g., MS Project, Primavera)
• Strong analytical skills to assess project data and identify trends.
• Experience in change management to navigate project scope adjustments effectively.
• Excellent problem-solving skills to find creative solutions to challenges.
• Ability to multitask and manage complex projects with competing priorities.

Design Expertise :
• Experience with Plant Design and Piping Practices, including highly skilled Pipe/Plant Design.
• Proficiency in piping design software like AutoCAD Plant 3D and SmartPlant3D.
• Solid understanding of Functional Design principles.
• Experience in 3D Plant design and modeling.
• Knowledge of Piping Design Services, including FEED, PFD, P&ID, 3D Plant modeling, and detailed drafting.

You're a great fit if you have:
• Proven experience in project management.
• A strong technical background in piping systems (relevant industry knowledge a plus).
• Excellent communication, interpersonal, and negotiation skills.
• The ability to manage multiple priorities, deadlines, and stakeholders effectively.

Benefits:
• Be part of a dynamic and growing team.
• Competitive salary and benefits package.
• Opportunity to work on challenging and rewarding projects.",False,4 days ago,"Surrey, BC",https://www.google.com/search?q=jobs&gl=ca&hl=en&udm=8#vhid=vt%3D20/docid%3DlYmCziuXFIhs-8hHAAAAAA%3D%3D&vssid=jobs-detail-viewer,,,,
